{
  "sources": [
    {
      "title": "Dwarf Fortress Development Log",
      "feedUrl": "http://www.bay12games.com/dwarves/dev_now.rss",
      "siteUrl": "http://www.bay12games.com/dwarves/index.html",
      "articles": [
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-06-15",
          "author": null,
          "description": "(Toady One) Here's \r\n\t\r\n\t\tthe last Steam News, concerning beekeeping\r\n\t\r\n, from earlier this month.\r\n\n\r\nSince then, I've mostly been working on the trade screen.  It's basically at a good spot now, though there are various bits that could be added, probably most notably the ability to view items again (it's not compatible with how we have our item sheets set up now, but I can work through it), and a few new lines of text to make the hidden haggling mechanics a little more sensible (to new players, counter-offers feel like they trigger at random, but it's actually based on skill rolls vs. profit/mood, etc.)  Also notably, there are item string filters now.  The little merchant in the top left is so low because creatures can be 64 pixels tall now, and dwarves can even be taller than 32 pixels if they have the right hair style, I think, but I'll probably adjust the positioning for smaller creatures before the end.  These sorts of things add up to make each of these screen rewrites take longer than expected, but another one down brings us that much closer.\r\n\n\r\nNext up we'll probably be looking at finishing the labor rewrite, the workshop profiles, and then how that all connects up e.g. to the military stuff (through e.g. civilian item assignments.)  That's also bound to get a little messy, ha ha.",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-06-15",
          "publishedOn": "2021-06-16T01:10:00.000Z",
          "wordCount": 13676,
          "title": "06/15/2021"
        },
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-06-01",
          "author": null,
          "description": "(Toady One) This month, not unusually, there is \r\n\t\r\n\t\ta monthly report.\r\n\t\r\n  Additionally, \r\n\t\r\n\t\ta reply to the Future of the Fortress questions from this month\r\n\t\r\n can be found by following the second link.  Most notably, the apartment move is done.",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-06-01",
          "publishedOn": "2021-06-01T23:48:00.000Z",
          "wordCount": 13450,
          "title": "06/01/2021"
        }
      ]
    },
    {
      "title": "fite me",
      "feedUrl": "https://pseudoartist.tumblr.com/rss",
      "siteUrl": "https://pseudoartist.tumblr.com/",
      "articles": []
    },
    {
      "title": "One Thing Well",
      "feedUrl": "http://onethingwell.org/rss",
      "siteUrl": "https://onethingwell.org/",
      "articles": []
    },
    {
      "title": "jwz",
      "feedUrl": "http://www.jwz.org/blog/feed/",
      "siteUrl": "https://www.jwz.org/blog/",
      "articles": [
        {
          "id": "https://jwz.org/b/yjoZ",
          "author": "jwz",
          "description": "The ETA Aquariids were towards the end of their shower on May 27, while the Arietids were at their beginning, so it could have been from either. Both tend to be more visible before dawn. Given that the image was snapped at 11:07 pm local time, the former might be more likely than the latter. The Arietids is one of the most intense meteoroids streams with up to 60 shooting stars an hour but most of them streak through the sky during the daytime so we don't see them.",
          "link": "https://www.jwz.org/blog/2021/06/volcano-fortress-versus-meteor-fight/",
          "publishedOn": "2021-06-14T19:53:30.000Z",
          "wordCount": 617,
          "title": "Volcano Fortress versus Meteor: Fight!"
        },
        {
          "id": "https://jwz.org/b/yjoY",
          "author": "jwz",
          "description": "Not even Catwoman pussy. \"In the third season of 'Harley Quinn' we had a moment where Batman was going down on Catwoman. And DC was like, 'You can't do that. You absolutely cannot do that.' They're like, 'Heroes don't do that.' So, we said, 'Are you saying heroes are just selfish lovers?' They were like, 'No, it's that we sell consumer toys for heroes. It's hard to sell a toy if Batman is also going down on someone.'\" The duo compares the series to \"The Mary Tyler Moore Show\" -- \"if Mary killed a bunch of people\".",
          "link": "https://www.jwz.org/blog/2021/06/heroes-dont-eat-pussy/",
          "publishedOn": "2021-06-14T19:29:50.000Z",
          "wordCount": 625,
          "title": "Heroes don't eat pussy."
        },
        {
          "id": "https://jwz.org/b/yjoX",
          "author": "jwz",
          "description": "Aaaaahhhhhh it's almost time!! Thanks to another extremely generous donor, we were able to re-surface the main stage, in the same manner as the dance floor! For the first time in the stage's 32 year life, it is actuallly level, and that weird bump in the middle (from a solitary glass block that used to poke through) is gone. Last year I put out a call for people who wanted to paint murals on some of our blank walls, but nothing really came of that, so last week I painted some chevrons on the balcony: I'd still like to get something painted on the walls inside the DNA Pizza and Above DNA restrooms, if only to cut down on the tagging. If you want to volunteer, let us know! Oh yeah, and since I mentioned last week that we could maybe give some old chandeliers a good home, three have shown up …",
          "link": "https://www.dnalounge.com/backstage/log/2021/06/14.html",
          "publishedOn": "2021-06-14T18:53:34.000Z",
          "wordCount": 823,
          "title": "DNA Lounge: Wherein we re-open in FOUR DAYS!"
        },
        {
          "id": "https://jwz.org/b/yjoW",
          "author": "jwz",
          "description": "Please enjoy jwz mixtape 228.",
          "link": "https://www.jwz.org/blog/2021/06/jwz-mixtape-228/",
          "publishedOn": "2021-06-13T16:57:46.000Z",
          "wordCount": 548,
          "title": "jwz mixtape 228"
        },
        {
          "id": "https://jwz.org/b/yjoV",
          "author": "jwz",
          "description": "Diver Nearly Swallowed By Humpback Whale: \"I was in his closed mouth for about 30 to 40 seconds before he rose to the surface and spit me out,\" Packard wrote. \"I am very bruised up but have no broken bones.\" [...] \"To be clear, the whale did not want him in its mouth,\" Kerr added, comparing the situation to an open-mouthed biker accidentally inhaling a fly.",
          "link": "https://www.jwz.org/blog/2021/06/to-be-clear-the-whale-did-not-want-him-in-its-mouth/",
          "publishedOn": "2021-06-13T06:06:50.000Z",
          "wordCount": 651,
          "title": "\"To be clear, the whale did not want him in its mouth\""
        },
        {
          "id": "https://jwz.org/b/yjoU",
          "author": "jwz",
          "description": "NullMemories:",
          "link": "https://www.jwz.org/blog/2021/06/spent-fuel-pools/",
          "publishedOn": "2021-06-12T18:55:39.000Z",
          "wordCount": 543,
          "title": "Spent Fuel Pools"
        },
        {
          "id": "https://jwz.org/b/yjoS",
          "author": "jwz",
          "description": "How the Web became unreadable",
          "link": "https://www.jwz.org/blog/2021/06/how-the-web-became-unreadable/",
          "publishedOn": "2021-06-12T17:28:10.000Z",
          "wordCount": 582,
          "title": "How the Web became unreadable"
        },
        {
          "id": "https://jwz.org/b/yjoR",
          "author": "jwz",
          "description": "\"Ultimate Slip 'N Slide\" Production Shut Down Over Explosive Diarrhea. The upcoming TV competition series has shut down indefinitely after up to 40 crew members fell violently ill during production on a remote ranch in Simi Valley, California. The outbreak of \"awful explosive diarrhea\" left people \"collapsing\" on set and \"being forced to run into port-o-potties.\" [...] According to an insider, many original crew members are reluctant to return to the shoot and blame the production for not ensuring that fresh, clean water was used on set. Plus side, maybe Ow My Balls will get picked up for a full season.",
          "link": "https://www.jwz.org/blog/2021/06/shitshow/",
          "publishedOn": "2021-06-12T17:23:49.000Z",
          "wordCount": 686,
          "title": "Shitshow"
        },
        {
          "id": "https://jwz.org/b/yjoQ",
          "author": "jwz",
          "description": "I always enjoy it when people tell on themselves with their font changes, making it clear that they have sent a hastily-edited form letter rather than a sincere one-to-one communication. Here's what a recent email looked like when viewed in Mail on iOS: And here's what it looked like in Mail on macOS. The difference is more subtle, but the text of [MAJOR METROPOLITAN AREA] is still smaller (capital letters are 25px instead of 28px). Also one of them is Arial and the other is Helvetica. Now, I know what you're thinking -- normally when someone makes that distinction you know that you're dealing with some kind of font-hipster super-nerd. This is true. But when they're side by side, sometimes even normal people can tell them apart! Here's an easy way to screw up like this on macOS: Compose an…",
          "link": "https://www.jwz.org/blog/2021/06/unintentional-forensic-edit-logs-via-font-changes/",
          "publishedOn": "2021-06-11T17:47:30.000Z",
          "wordCount": 993,
          "title": "Unintentional forensic edit logs via font changes"
        },
        {
          "id": "https://jwz.org/b/yjoP",
          "author": "jwz",
          "description": "Rep. Louie Gohmert (R-TX) asks whether the Forest Service or the BLM can alter the orbit of the moon or the Earth in order to fight climate change during a House Natural Resources hearing. \"I would have to follow up with you on that, Mr. Gomert.\"",
          "link": "https://www.jwz.org/blog/2021/06/chrome-the-moon-for-a-brighter-tomorrow/",
          "publishedOn": "2021-06-09T17:28:43.000Z",
          "wordCount": 821,
          "title": "Chrome The Moon for a Brighter Tomorrow!",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/78e12mrt1qxgm9gf.mp4",
            "length": "1499361",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjoO",
          "author": "jwz",
          "description": "XScreenSaver 6.01 is out now. This is an X11-only maintenance release, so there are no macOS, iOS or Android packages this time around. The 6.00 refactor of the X11 XScreenSaver daemon has so far proven to be very stable and secure! The bugs fixed in this release are relatively minor. However: If you are using 6.00, I strongly recommend upgrading to 6.01. If you are using 5.xx, I strongly, strongly recommend upgrading to 6.01. Sadly, due to recent catastrophic decision-making on the part of certain Linux distros, I was forced to add the following section to the XScreenSaver manual: THE WAYLAND PROBLEM Wayland is a completely different window system that is intended to replace X11. After 13+ years of trying, some Linux distros have finally begun enabling it by default. Most deployments of it also include XWayland, which is a compatibility layer that allows some X11 programs to continue to work within a Wayland environment. Unfortunately, XScreenSaver is not one of those programs. If your system is running XWayland, XScreenSaver will malfunction in two ways: It will be unable to detect user activity in non-X11 programs. This means that while a native Wayland program is selected, XScreenSaver will think that you are idle, and may blank the screen prematurely. It will be unable to lock the screen. This is because X11 grabs don't work properly under XWayland, so there is no way for XScreenSaver to prevent the user from switching away from the screen locker to another application. If you are aware of some way for XScreenSaver to reliably detect user activity under Wayland, do let me know. Maybe there is some dbus/systemd signal that I have missed? Now that the XScreenSaver 6.x daemon has been sandboxed and massively reduced in size, it might be plausible for someone to rewrite xscreensaver.c to speak Wayland instead of X11, to run inside the Wayland compositor, and then to launch the X11 programs xscreensaver-auth and xscreensaver-gfx as needed. But that someone will not be me.",
          "link": "https://www.jwz.org/blog/2021/06/xscreensaver-6-01-out-now/",
          "publishedOn": "2021-06-09T16:34:45.000Z",
          "wordCount": 969,
          "title": "XScreenSaver 6.01 out now"
        },
        {
          "id": "https://jwz.org/b/yjoN",
          "author": "jwz",
          "description": "One of life's simple joys is pointing a video camera at a TV. We should all do that more often. We recently got a screaming deal on this gargantuan 75\" TV, so we turned it into an instagram trap under the main stairs. I think it's going to be very popular! \"What software does it use?\" None, it uses none software. Video feedback works better if it stays in the analog domain, as with 30+ year old camcorders and CRTs rather than that four letter word \"HDMI\", but one does what one can. Hey, here's an interior decoration project maybe one of you could help us out with. The Green Room, that room to the South of the Lounge that you enter from the stage-left stairs, has always been less inviting than we'd like. People treat it as more of a hallway than as a place to hang out. I think it could use a bunch of overstuffed thrift-shop couches and chairs -- really gaudy stuff -- and also a shitload of chandeliers. It has a surprisingly high ceiling, and I think that filling that space with dozens of chandeliers might look pretty cool. So, if you are a person who already has the hobby of frequenting thrift shops and estate sales, I'd love to give you a small monthly budget for broken down chandeliers and couches to dress up that room. (The couches, I assume, won't long survive contact with the enemy and will need to be periodically replenished.)",
          "link": "https://www.dnalounge.com/backstage/log/2021/06/06.html",
          "publishedOn": "2021-06-06T17:34:46.000Z",
          "wordCount": 653,
          "title": "DNA Lounge: Wherein we value your feedback"
        },
        {
          "id": "https://jwz.org/b/yjoK",
          "author": "jwz",
          "description": "Caring For Your Geriatric Millennial",
          "link": "https://www.jwz.org/blog/2021/06/caring-for-your-geriatric-millennial/",
          "publishedOn": "2021-06-04T19:48:50.000Z",
          "wordCount": 622,
          "title": "Caring For Your Geriatric Millennial"
        },
        {
          "id": "https://jwz.org/b/yjoI",
          "author": "jwz",
          "description": "Truck full of traffic lights.",
          "link": "https://www.jwz.org/blog/2021/06/using-ritual-magic-to-trap-self-driving-cars-2/",
          "publishedOn": "2021-06-03T21:06:40.000Z",
          "wordCount": 698,
          "title": "Using Ritual Magic to Trap Self-Driving Cars",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/wkhklg_6qvphsxcg.mp4",
            "length": "422829",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjoH",
          "author": "jwz",
          "description": "Prayer Posts: Facebook confirmed that the social media platform is currently testing the prayer post feature. \"Our mission to give people the power to build community extends to the world's largest community; the faith community,\" Nona Jones, head of Global Faith Partnerships at Facebook, said in a written statement to Religion News Service. (I can't find any source for these important informations from a site without 'Christian' or 'Religion' in its name, so this may be bullshit.)",
          "link": "https://www.jwz.org/blog/2021/06/and-you-will-know-my-name-is-the-lord-when-you-accept-my-tracking-cookie/",
          "publishedOn": "2021-06-03T17:07:12.000Z",
          "wordCount": 930,
          "title": "And you will know my name is THE LORD when you accept my TRACKING COOKIE"
        },
        {
          "id": "https://jwz.org/b/yjoG",
          "author": "jwz",
          "description": "\"We here at Weyland-Yutani Corporation would like to wish a happy Pride Month to all of our LGBT colonists on LV-426.\" Also Omni Consumer Products, Cyberdyne Systems, Umbrella Corporation, and Tyrell Corporation.",
          "link": "https://www.jwz.org/blog/2021/06/brands/",
          "publishedOn": "2021-06-01T18:03:58.000Z",
          "wordCount": 604,
          "title": "Brands"
        },
        {
          "id": "https://jwz.org/b/yjoF",
          "author": "jwz",
          "description": "We just picked up a 75\" TV for super cheap and we're trying to figure out what to do with it. I was thinking maybe we'd set it up vertically (5'6\" tall!) and turn it into some kind of \"magic mirror\" where it does video effects on your reflection or something. Is there any good software out there for that? Any other suggestions? It's very heavy, so using it as an on-stage prop would be a hassle; it needs to be mounted somewhere. We could just stick it in the DNA Pizza window and use it for signage, but that's not very exciting.",
          "link": "https://www.jwz.org/blog/2021/05/what-to-do-with-a-big-tv/",
          "publishedOn": "2021-05-29T18:44:27.000Z",
          "wordCount": 774,
          "title": "What to do with a big TV?"
        },
        {
          "id": "https://jwz.org/b/yjoE",
          "author": "jwz",
          "description": "Body parts, due to their hollow nature, often contain water. We do not want them to leak in your car. You can bring a cordless drill to let \"water\" out. We often get asked about hands. You are welcome to hands but there is a limit of 5 pairs per customer along with other parts. Under no circumstances whatsoever will you be able to fill your car boot with hands. Please don't ask.",
          "link": "https://www.jwz.org/blog/2021/05/mannequin-mountain/",
          "publishedOn": "2021-05-28T18:05:10.000Z",
          "wordCount": 624,
          "title": "Mannequin Mountain"
        },
        {
          "id": "https://jwz.org/b/yjoD",
          "author": "jwz",
          "description": "Suncreen infosec",
          "link": "https://www.jwz.org/blog/2021/05/suncreen-infosec/",
          "publishedOn": "2021-05-26T16:37:42.000Z",
          "wordCount": 471,
          "title": "Suncreen infosec"
        },
        {
          "id": "https://jwz.org/b/yjoC",
          "author": "jwz",
          "description": "Here's the worst part about switching to a new point-of-sale system: buying a whole stack of new iPads. And this is less than half of them. Because of course the perfectly functional iPads we already have are now unsuitable. These things would have been considered supercomputers in the 90s, but I'm to believe that they are so old and obsolete that they are incapable of keeping up with someone clicking the button that says \"cheese slice\". A task like that obviously requires the absolute bleeding edge. Apple has stopped shipping OS updates for our existing iPads, and vendors don't support old versions of iOS, largely because Apple intentionally makes it nearly impossible for them to do so even if they wanted to. The second worst part is that nobody offers data portability of any kind. If we …",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/25.html",
          "publishedOn": "2021-05-26T03:54:55.000Z",
          "wordCount": 2314,
          "title": "DNA Lounge: Wherein we have a new POS"
        },
        {
          "id": "https://jwz.org/b/yjoB",
          "author": "jwz",
          "description": "Here's a final photo of our new dance floor, after being painted and before anyone has thrown up on it, or dragged a road case across it where half of the wheels have been replaced with jagged pieces of sheet metal: We re-surfaced the Above DNA stage. No more burlesque performers complaining about getting splinters in their butts! We replaced the floor in our walk-in fridge. Ten years of dragging beer kegs over it took quite a toll: And we built a new VIP booth. We've replaced the two upstairs 6-person booths with a single 9-person booth. It's raised on a platform like downstairs, and has three benches and is a bit more enclosed than the others: Only 35 more days until we get to invite you back inside!",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/24.html",
          "publishedOn": "2021-05-24T17:31:49.000Z",
          "wordCount": 314,
          "title": "DNA Lounge: Wherein the construction will continue until morale improves."
        },
        {
          "id": "https://jwz.org/b/yjn-",
          "author": "jwz",
          "description": "The IDF has been using small drones to drop tear gas on protesters in Ramallah in the West Bank.",
          "link": "https://www.jwz.org/blog/2021/05/tear-gas-drones/",
          "publishedOn": "2021-05-23T16:08:31.000Z",
          "wordCount": 599,
          "title": "Tear Gas Drones",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/5ifwwuqnb9w-ypuh.mp4",
            "length": "572617",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjn9",
          "author": "jwz",
          "description": "Please welcome DNA Lounge Brand Dark Rum to the family, complementing our existing selection of Silver Rum, Vodka, Gin, Whiskey and Bourbon. Order your bottle today from DNA Pizza or pick up a bottle in person tonight and collect the whole set!",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/22.html",
          "publishedOn": "2021-05-22T16:41:18.000Z",
          "wordCount": 177,
          "title": "DNA Lounge: Wherein we've got dark rum!"
        },
        {
          "id": "https://jwz.org/b/yjn6",
          "author": "jwz",
          "description": "Dear Lazyweb, I've had a couple of people report that after upgrading to Fedora 34, XScreenSaver 6.00 has stopped being able to detect user activity and activates prematurely. From the logs they sent, it looks like the XInput2 extension still exists but has stopped working entirely. No events are printed by driver/test-xinput (with no args, or with -grab -kbd-async -mouse-async). Can anyone confirm or deny this? The server is still X.Org 12101001, however it was launched by sddm / startplasma / Xwayland and the environment contains XDG_SESSION_TYPE=wayland and WAYLAND_DISPLAY=wayland-0. So maybe it's Wayland that is screwing everything up? One user was using Gnome and one was using KDE. Maybe there's a way to configure the system to go back to running \"real\" X11 instead of whatever fresh hell of X11 / Wayland hybridization this is? Or is there some way for me to infect Raspbian 10.9 with this hybridization so that I can reproduce it myself? Related question: At some point in the distant past, I convinced myself that Wayland was incompatible with XScreenSaver locking, and therefore XScreenSaver refuses to lock when $WAYLAND_DISPLAY is set. I commented this change with \"X11 grabs don't work under Wayland's embedded X11 server. The Wayland window manager lives at a higher level than the X11 emulation layer.\" However, now I can't find any record of what the actual problem was. Do you know? My guess is that it's something like running X11 under macOS: the grabs stay inside the X11 app, but you can still use Cmd-Tab to switch away to non-X11 apps even if X11 thinks things are \"locked\" inside its little sandbox. But I don't remember.",
          "link": "https://www.jwz.org/blog/2021/05/xscreensaver-wayland-shenanigans/",
          "publishedOn": "2021-05-22T16:30:35.000Z",
          "wordCount": 2380,
          "title": "XScreenSaver Wayland shenanigans"
        },
        {
          "id": "https://jwz.org/b/yjn5",
          "author": "jwz",
          "description": "Just spit on your hand and see what's gurgling around in there.",
          "link": "https://www.jwz.org/blog/2021/05/burmese-peacock-softshell-turtle/",
          "publishedOn": "2021-05-22T15:36:00.000Z",
          "wordCount": 519,
          "title": "Burmese peacock softshell turtle",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/scneuv8v2hbmqbds.mp4",
            "length": "1168489",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjn4",
          "author": "jwz",
          "description": "As always, takedowns happen in seconds, and the appeals are processed in just as timely a fashion -- only 1,602 days this time. Fifty-three months! From: Instagram <no-reply@mail.instagram.com> Subject: Your video has been re-posted. Date: Fri, 21 May 2021 11:43:29 -0700 We received your appeal and re-posted the video you originally shared at 1:25 PM on December 31, 2016. View Video",
          "link": "https://www.jwz.org/blog/2021/05/fucking-facebook-4/",
          "publishedOn": "2021-05-21T19:28:26.000Z",
          "wordCount": 905,
          "title": "Fucking Facebook"
        }
      ]
    },
    {
      "title": "Trivium",
      "feedUrl": "http://chneukirchen.org/trivium/index.atom",
      "siteUrl": "https://leahneukirchen.org/trivium/",
      "articles": [
        {
          "id": "https://leahneukirchen.org/trivium/2021-06-06",
          "author": null,
          "description": "Cores that don’t count (PDF),\nby Peter H. Hochschild, Paul Turner, Jeffrey C. Mogul,\nRama Govindaraju, Parthasarathy Ranganathan, David E. Culler, and Amin Vahdat.\n“As fabrication pushes towards smaller feature sizes and more\nelaborate computational structures, and as increasingly specialized\ninstruction-silicon pairings are introduced to improve performance, we\nhave observed ephemeral computational errors that were not detected\nduring manufacturing tests. These defects cannot always be mitigated\nby techniques such as microcode updates, and may be correlated to\nspecific components within the processor, allowing small code changes\nto effect large shifts in reliability. Worse, these failures are often\n“silent” – the only symptom is an erroneous computation.”\nOh no.\nUnix Shell Programming: The Next 50 Years (PDF),\nby Michael Greenberg, Konstantinos Kallas, and Nikos Vasilakis.\nM1ssing Register Access Controls Leak EL0 State,\nM1RACLES (CVE-2021-30747) is a covert channel vulnerability in the\nApple Silicon “M1” chip.\nA metalanguage for multi-phase modularity (PDF),\nby Jonathan Sterling and Robert Harper.\nHalf a year of the Liquid Tensor Experiment: Amazing developments,\nby Peter Scholze.\nIntroduction to Univalent Foundations of Mathematics with Agda,\nby Martín Hötzel Escardó.\n“We introduce Voevodsky’s univalent foundations and univalent\nmathematics, and explain how to develop them with the computer system\nAgda, which is based on Martin-Löf type theory.”\nA Short Introduction to Categorical Logic (YouTube),\nby Evan Patterson at the Topos Institute.\nJoseph Weizenbaum’s Original ELIZA, Computer Conversations (1965).\nThe Sweden Solar System is the world’s largest permanent scale model\nof the Solar System. The model represents the Solar System on the\nscale of 1:20 million.",
          "link": "https://leahneukirchen.org/trivium/2021-06-06",
          "publishedOn": "2021-06-06T19:00:46.000Z",
          "wordCount": 269,
          "title": "06jun2021"
        },
        {
          "id": "https://leahneukirchen.org/trivium/2021-05-24",
          "author": null,
          "description": "FragAttacks, a collection of new security vulnerabilities that\naffect Wi-Fi devices.\nCounterexamples in Type Systems, by Stephen Dolan.\nThree Realisms and The Idea of Sheaves (YouTube),\ntalk by David Jaz Myers.\nExplains many complicated terms in a graphical way.\nPepper, a simple and opinionated modal code editor for your terminal.\nStill early but feels pretty nice already.\nbpftrace-2048, because you can.\nBaking Magnetic Recording Tape, sometimes you just have to.\nSoda locomotive\nNEW SESSION",
          "link": "https://leahneukirchen.org/trivium/2021-05-24",
          "publishedOn": "2021-05-24T19:22:52.000Z",
          "wordCount": 88,
          "title": "24may2021"
        }
      ]
    },
    {
      "title": "Lambda the Ultimate - Programming Languages Weblog",
      "feedUrl": "http://lambda-the-ultimate.org/rss.xml",
      "siteUrl": "http://lambda-the-ultimate.org",
      "articles": []
    },
    {
      "title": "*incoherent yelling about worms*",
      "feedUrl": "http://gfzoda.tumblr.com/rss",
      "siteUrl": "https://gfzoda.tumblr.com/",
      "articles": [
        {
          "id": "https://gfzoda.tumblr.com/post/654256590092992512",
          "author": null,
          "description": "ewil:\n\ndelusional-cannibal:\newil:\n\n\n\nthis is the worst website",
          "link": "https://gfzoda.tumblr.com/post/654256590092992512",
          "publishedOn": "2021-06-17T16:35:06.000Z",
          "wordCount": 273,
          "title": "ewil:delusional-cannibal:\n\newil:\n\nmurder is bad? even if i say sorry afterwards? even if i am an..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654166254196817920",
          "author": null,
          "description": "neotrances:\n\ni like being out of the loop on every video game franchise ever bc u guys are on the dash right now like “PEBBLE NEBBLE FROM SUPER SQUIRT GALAXY JUST GOT ANNOUNCED FOR SMASH WORLD” and it means something i think, not to me, but it means a lot to you and thats whats important",
          "link": "https://gfzoda.tumblr.com/post/654166254196817920",
          "publishedOn": "2021-06-16T16:39:15.000Z",
          "wordCount": 304,
          "title": "neotrances:i like being out of the loop on every video game franchise ever bc u guys are on the dash..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654016118369009665",
          "author": null,
          "description": "fruitz:",
          "link": "https://gfzoda.tumblr.com/post/654016118369009665",
          "publishedOn": "2021-06-15T00:52:54.000Z",
          "wordCount": 248,
          "title": "fruitz:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654016086334980096",
          "author": null,
          "description": "local-friendlycryptid:\n\nanxietyproblem:\n\n[ID: A screenshot from Facebook from (@kev Thomas) it says “life is a tornado and I’m just a cow being spun around for cinematic value”/END ID]",
          "link": "https://gfzoda.tumblr.com/post/654016086334980096",
          "publishedOn": "2021-06-15T00:52:24.000Z",
          "wordCount": 278,
          "title": "local-friendlycryptid:anxietyproblem:[ID: A screenshot from Facebook from (@kev Thomas) it says..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885489528651776",
          "author": null,
          "description": "catchymemes:",
          "link": "https://gfzoda.tumblr.com/post/653885489528651776",
          "publishedOn": "2021-06-13T14:16:37.000Z",
          "wordCount": 247,
          "title": "Astronaut tweets"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885461923872768",
          "author": null,
          "description": "babyphat05:\n\nMeeting friends is so much harder than people think. Like actually finding a group of people who you can genuinely vibe with and who you can trust is a hard process that can take years on top of years. Making fun of people who may have a harder time meeting friends is whack, it’s really not something that happens overnight.",
          "link": "https://gfzoda.tumblr.com/post/653885461923872768",
          "publishedOn": "2021-06-13T14:16:10.000Z",
          "wordCount": 338,
          "title": "babyphat05:Meeting friends is so much harder than people think. Like actually finding a group of..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885446226608128",
          "author": null,
          "description": "dwarvishring:\n\nian mckellen directed these movies actually",
          "link": "https://gfzoda.tumblr.com/post/653885446226608128",
          "publishedOn": "2021-06-13T14:15:55.000Z",
          "wordCount": 264,
          "title": "dwarvishring:ian mckellen directed these movies actually"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653809037370114049",
          "author": null,
          "description": "sugary-bowl:\nkropotkindersurprise:\n\nJune 22 2019 - A fascist trying to pick a fight at Bologna Pride gets more reaction than he bargained for. [video]\n\n\nExit, pursued by bear.",
          "link": "https://gfzoda.tumblr.com/post/653809037370114049",
          "publishedOn": "2021-06-12T18:01:26.000Z",
          "wordCount": 283,
          "title": "sugary-bowl:\n\nkropotkindersurprise:June 22 2019 - A fascist..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653793552742187008",
          "author": null,
          "description": "theplantqueer:\n\nsciencevevo:\nthyrell:\nout: gender reveal party\nin: gender repeal party\n\n[ID: Laura Jane Grace grinning and burning her birth certificate live on stage /end ID]",
          "link": "https://gfzoda.tumblr.com/post/653793552742187008",
          "publishedOn": "2021-06-12T13:55:19.000Z",
          "wordCount": 275,
          "title": "theplantqueer:\nsciencevevo:\n\nthyrell:\n\nout: gender reveal party\nin: gender repeal party\n\n\n\n[ID:..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653793217813331968",
          "author": null,
          "description": "zooterscooter:\n\nlistening to will wood and the tapeworms like",
          "link": "https://gfzoda.tumblr.com/post/653793217813331968",
          "publishedOn": "2021-06-12T13:50:00.000Z",
          "wordCount": 262,
          "title": "zooterscooter:listening to will wood and the tapeworms like"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653708816226140160",
          "author": null,
          "description": "cipheramnesia:\n\ncipheramnesia:\n\nI don’t care about hot girl summer, but everyone better fucking be vaccinated by Halloween, feel me? \n\nout of the way hot girl summer \nMonster Fucker Fall is gonna get it",
          "link": "https://gfzoda.tumblr.com/post/653708816226140160",
          "publishedOn": "2021-06-11T15:28:28.000Z",
          "wordCount": 302,
          "title": "cipheramnesia:cipheramnesia:I don&rsquo;t care about hot girl summer, but everyone better fucking be..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653639767004758016",
          "author": null,
          "description": "red-faced-wolf:\n\nkaijuno:\n\nWait this is funny\n\nThis humor is so fucking advanced yet so fucking simple at the same time",
          "link": "https://gfzoda.tumblr.com/post/653639767004758016",
          "publishedOn": "2021-06-10T21:10:57.000Z",
          "wordCount": 279,
          "title": "red-faced-wolf:kaijuno:Wait this is funnyThis humor is so fucking advanced yet so fucking simple at..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653623266934669312",
          "author": null,
          "description": "coldasawitchestit:\n\nSomething that makes me happy. Witches of the Discworld. They make me feel strong",
          "link": "https://gfzoda.tumblr.com/post/653623266934669312",
          "publishedOn": "2021-06-10T16:48:42.000Z",
          "wordCount": 290,
          "title": "coldasawitchestit:Something that makes me happy. Witches of the Discworld. They make me feel strong"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653620928229556224",
          "author": null,
          "description": "phemiec:\n\nReading The Lock Tomb series like:\nHeart wrenchingly beautiful prose-TEN YEAR OLD MEME-descriptive language so visceral and brilliant you feel it through your whole body-HORRIBLE DAD JOKE-a paragraph so original, poignant and resonant it’s like nothing you’ve ever read before, to the point where you’re sure you’re reading the work of a genius, the likes of which have never before- HOMESTUCK REFERENCE. ANOTHER EVEN WORSE DAD JOKE. TWENTY YEAR OLD MEME. FUCK YOUR IMMERSION, GET RICK ROLLED BITCH.",
          "link": "https://gfzoda.tumblr.com/post/653620928229556224",
          "publishedOn": "2021-06-10T16:11:31.000Z",
          "wordCount": 341,
          "title": "phemiec:Reading The Lock Tomb series like:Heart wrenchingly beautiful prose-TEN YEAR OLD..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653603419797504000",
          "author": null,
          "description": "callmebliss-got-swamped:\n\nkaczynskis:\n\nI clicked fearing it would be Out Of Touch but, instead, it is perfectly splendid",
          "link": "https://gfzoda.tumblr.com/post/653603419797504000",
          "publishedOn": "2021-06-10T11:33:14.000Z",
          "wordCount": 263,
          "title": "callmebliss-got-swamped:kaczynskis:I clicked fearing it would be Out Of Touch but, instead, it is..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653469269034729472",
          "author": null,
          "description": "cheeseanonioncrisps:\n\nFact 1: ‘Rubber duck debugging’ is a programming technique whereby a programmer explains their code, line by line, to a rubber duck. The idea is that in explaining it they will eventually figure out what the problem is.\nFact 2: In the same way, a lot of ordinary non-programming problems can be solved by talking them over with a friend, even if said friend does not actually know that much about the topic/situation and can’t contribute much to the conversation.\nFact 3: When you thank said friend for helping you solve your problem, and they reply “I didn’t really say anything”, it is very inadvisable to take the opportunity to tell them about Fact 1. No matter how interesting a comparison it may seem at the time.",
          "link": "https://gfzoda.tumblr.com/post/653469269034729472",
          "publishedOn": "2021-06-09T00:00:58.000Z",
          "wordCount": 375,
          "title": "cheeseanonioncrisps:Fact 1: &lsquo;Rubber duck debugging&rsquo; is a programming technique whereby a..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444588162383872",
          "author": null,
          "description": "nascencio:\n\napplejuicewerewolf:\n\noflightbluecupcakes:\n\nesclapo:\n\nrikusqueenofhearts:\n\nkleeklutch:\n\n\nhappy pride month to country mama lynn and country mama lynn only\n\nSomeone give this woman a damn crown and medal\n\nHappy pride month to country mama lynn and ger gay son only\n\nCountry mama Lynn and her baseball bat could protect pride better than any cop",
          "link": "https://gfzoda.tumblr.com/post/653444588162383872",
          "publishedOn": "2021-06-08T17:28:40.000Z",
          "wordCount": 300,
          "title": "nascencio:applejuicewerewolf:oflightbluecupcakes:esclapo:rikusqueenofhearts:kleeklutch:happy pride..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444410559889408",
          "author": null,
          "description": "raevenlywrites:\n\nraevenlywrites:\n\nYou can read a summary of my gender for free but the full gender is behind a paywall\n\nYou can perceive my gender five times a month for free but if you want to stay up to date on my latest gender you’ll have to subscribe",
          "link": "https://gfzoda.tumblr.com/post/653444410559889408",
          "publishedOn": "2021-06-08T17:25:51.000Z",
          "wordCount": 290,
          "title": "raevenlywrites:raevenlywrites:You can read a summary of my gender for free but the full gender is..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444383553830912",
          "author": null,
          "description": "sharper-and-bigger:\n\nmartianaviator:\n\nysabelmystic:\n\nI just heard my mom tell my brother, “when you die, you will go outside and garden until your father says you’re done” and it took me a second to realize that my brother was playing a videogame and this was not a theological discussion. \n\nPurgatory\n\nThe Garden of Death\nWatercolor and gouache by Hugo Simberg, 1896",
          "link": "https://gfzoda.tumblr.com/post/653444383553830912",
          "publishedOn": "2021-06-08T17:25:25.000Z",
          "wordCount": 320,
          "title": "sharper-and-bigger:martianaviator:ysabelmystic:I just heard my mom tell my brother, “when you die,..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444299296538624",
          "author": null,
          "description": "clementiens:",
          "link": "https://gfzoda.tumblr.com/post/653444299296538624",
          "publishedOn": "2021-06-08T17:24:05.000Z",
          "wordCount": 245,
          "title": "clementiens:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653353561014566912",
          "author": null,
          "description": "qillermeme:",
          "link": "https://gfzoda.tumblr.com/post/653353561014566912",
          "publishedOn": "2021-06-07T17:21:50.000Z",
          "wordCount": 243,
          "title": "qillermeme:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653250585711263744",
          "author": null,
          "description": "cheese-whiz-barber:\n\nSome pride flags color picked from gastropods",
          "link": "https://gfzoda.tumblr.com/post/653250585711263744",
          "publishedOn": "2021-06-06T14:05:05.000Z",
          "wordCount": 266,
          "title": "cheese-whiz-barber:Some pride flags color picked from gastropods"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653250042755448833",
          "author": null,
          "description": "leonardepsilonchurch:\nCracking open a cold one1 with the boys.\n1: A can of worms.",
          "link": "https://gfzoda.tumblr.com/post/653250042755448833",
          "publishedOn": "2021-06-06T13:56:27.000Z",
          "wordCount": 91,
          "title": "leonardepsilonchurch:\n\nCracking open a cold one1 with the boys.1: A can of worms."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653245585532551168",
          "author": null,
          "description": "mooonbride:\n\nYou’re laughing. This is my second form and the latin choir has started singing, and you’re laughing.",
          "link": "https://gfzoda.tumblr.com/post/653245585532551168",
          "publishedOn": "2021-06-06T12:45:37.000Z",
          "wordCount": 284,
          "title": "mooonbride:You’re laughing. This is my second form and the latin choir has started singing, and..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653244501707685888",
          "author": null,
          "description": "vivienvalentino:\n\n\nspotalike creates a playlist based on a song\nmagicplaylist \n\ncreates a playlist based on a song\n\n\ndubolt \n\ncreates a playlist based on an artist\nboilthefrog creates a playlist between any two artists \npredominant suggests you albums based on cover art color   \nmusic-map \n\nsuggests similar artists\ngnoosic \n\nsuggests similar artists and songs",
          "link": "https://gfzoda.tumblr.com/post/653244501707685888",
          "publishedOn": "2021-06-06T12:28:23.000Z",
          "wordCount": 327,
          "title": "some sites for when you’re bored and looking for new music"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653244062708744192",
          "author": null,
          "description": "adelicateculturecell:\n\n\nJourney to the Microcosmos- Flatworms: Simple Wiggly Tubes\n\nImages Originally Captured by Jam’s Germs\nQuote Voiced by Jam’s Germs",
          "link": "https://gfzoda.tumblr.com/post/653244062708744192",
          "publishedOn": "2021-06-06T12:21:24.000Z",
          "wordCount": 275,
          "title": "adelicateculturecell:\n\n\n\nJourney to the Microcosmos- Flatworms:..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653094095015837696",
          "author": null,
          "description": "avanjogiagf:",
          "link": "https://gfzoda.tumblr.com/post/653094095015837696",
          "publishedOn": "2021-06-04T20:37:44.000Z",
          "wordCount": 247,
          "title": "avanjogiagf:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653073453988085760",
          "author": null,
          "description": "odin-n-out:\n\nodin-n-out:\n\nI feel absolute rage when i call An Office and have to sit through a 5 minute recording telling me I can just use their website thanks!!! I can’t! Believe it or not I’m a child of the internet age who went on your website and it was shit!! Get me a human person!!!!",
          "link": "https://gfzoda.tumblr.com/post/653073453988085760",
          "publishedOn": "2021-06-04T15:09:39.000Z",
          "wordCount": 320,
          "title": "odin-n-out:odin-n-out:I feel absolute rage when i call An Office and have to sit through a 5 minute..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005794301902848",
          "author": null,
          "description": "quixoty:\n\ngutter-guy:\ngutter-guy:\nYou shouldn’t be treating nb people like the secret sexy 3rd gender. Nb people don’t look like a mash of male and female, they’re not sexy androgynous twinks\n\nwhite skinny androgynous nb people reblogging this and saying shit like “Well this is what I look like! So I feel represented!” Are literally part of the problem. I’m not saying that no nb people are white/skinny/andro, I’m saying that those are the only type of nb bodies that get represented \n\n\nits nice, isnt it, when nonbinary people are visibly distinct from binary people? its easy, isnt it? you can remember to use “they” for people who have no visible breasts or beards, right? no need to challenge the notion of male vs female if nonbinary people have their own look, isnt that right?\nits time to step the fuck up and really understand that nonbinary looks like anybody. nonbinary looks like you. nonbinary looks like your family and friends and it looks like the strangers who you thoughtlessly call “he” or “she” because of their appearance.\nreally supporting nonbinary people means understanding that theres no visual tell - you wont recognise all of us as nonbinary on sight. you have to actually LISTEN to us. you have to BELIEVE us. and it means challenging your assumptions about gender, starting with the assumption that youre an ally to trans people while youre still doing puerile shit like gendering body parts and clothes.\nNONBINARY LOOKS LIKE ANYBODY. ANY BODY CAN BE NONBINARY.",
          "link": "https://gfzoda.tumblr.com/post/653005794301902848",
          "publishedOn": "2021-06-03T21:14:14.000Z",
          "wordCount": 522,
          "title": "quixoty:\ngutter-guy:\n\ngutter-guy:\nYou shouldn’t be treating nb people like the secret sexy 3rd..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005764339875840",
          "author": null,
          "description": "serialephemera:\n\nThematically speaking, the most important thing Terry Pratchett taught me was the concept of militant decency. The idea that you can look at the world and its flaws and its injustices and its cruelties and get deeply, intensely angry, and that you can turn that into energy for doing the right thing and making the world a better place. He taught me that the anger itself is not the part I should be fighting. Nobody in my life ever said that before.",
          "link": "https://gfzoda.tumblr.com/post/653005764339875840",
          "publishedOn": "2021-06-03T21:13:45.000Z",
          "wordCount": 329,
          "title": "serialephemera:Thematically speaking, the most important thing Terry Pratchett taught me was the..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005701107662848",
          "author": null,
          "description": "leafdyke:\n\n“humanity is inherently selfish and bad” bbbrrrghuhjfkg. humanity is seeing a stranger’s grocery bag break open on the sidewalk and harvesting fruits and veggies from the branch-like cracks of the asphalt for them, just because you can. humanity is helping a lost child find their mother on a crowded beach, looking for the ladybug-patterned parasol with their hummingbird-small hand in yours. it’s an elder’s fingers wrapped around your arm as you help them up the stairs because the elevator is broken, and feeling like you’re doing exactly what you’re supposed to be doing, like this is what you would’ve been doing had you been alive centuries or even millennia ago. there will always be a heavily pregnant woman who will smile at your when you give up your seat, a nice blind man in the fruit aisle who will ask you to please pick the riper plantain for him, a tired cashier whose face will light up when you compliment their tattoo sleeve. humanity is connection",
          "link": "https://gfzoda.tumblr.com/post/653005701107662848",
          "publishedOn": "2021-06-03T21:12:45.000Z",
          "wordCount": 431,
          "title": "leafdyke:“humanity is inherently selfish and bad” bbbrrrghuhjfkg. humanity is seeing a stranger’s..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005504345440256",
          "author": null,
          "description": "monstrousgourmandizingcats:\n\nheadspace-hotel:\n\nheadspace-hotel:\n\nheadspace-hotel:\n\nshoutout to everybody who cannot partake in the shared history spongebob memes give everyone because they were, for some inexplicable reason, never allowed to watch spongebob \n\nIt’s weird because unlike most other experiences, this is not one you can go back and rectify. It’s already too late for me to grow up watching spongebob  \n\nFew things in this world can be genuinely lost forever and I don’t know how to feel that this, of all things, is one of them \n\n\n\nI disliked Spongebob as a kid and decided on my own not to watch it. It kept preempting ATLA.",
          "link": "https://gfzoda.tumblr.com/post/653005504345440256",
          "publishedOn": "2021-06-03T21:09:37.000Z",
          "wordCount": 396,
          "title": "monstrousgourmandizingcats:headspace-hotel:headspace-hotel:headspace-hotel:shoutout to everybody who..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652917645695418368",
          "author": null,
          "description": "mossworm:\n\nbee time",
          "link": "https://gfzoda.tumblr.com/post/652917645695418368",
          "publishedOn": "2021-06-02T21:53:09.000Z",
          "wordCount": 250,
          "title": "mossworm:bee time"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652726713769459712",
          "author": null,
          "description": "teaboot:\n\nOld man insults are wild. “Slut”, “Whore”, “Dumb Bitch”….. Sir, those are respectable occupations. Call me a landlord",
          "link": "https://gfzoda.tumblr.com/post/652726713769459712",
          "publishedOn": "2021-05-31T19:18:22.000Z",
          "wordCount": 292,
          "title": "teaboot:Old man insults are wild. &ldquo;Slut&rdquo;, &ldquo;Whore&rdquo;, &ldquo;Dumb..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652637723166965760",
          "author": null,
          "description": "marianhalcombes:\n\nmarianhalcombes:\n\ni like mad scientists bc i think we should all get to indulge in being gay, evil, and insufferably smart\n\nno more of that “im gay and stupid” nonsense im gay and smart and im building a man that will be my downfall",
          "link": "https://gfzoda.tumblr.com/post/652637723166965760",
          "publishedOn": "2021-05-30T19:43:54.000Z",
          "wordCount": 291,
          "title": "marianhalcombes:marianhalcombes:i like mad scientists bc i think we should all get to indulge in..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652518166019342336",
          "author": null,
          "description": "newtonpermetersquare:\n\nSo that’s basically how it went down",
          "link": "https://gfzoda.tumblr.com/post/652518166019342336",
          "publishedOn": "2021-05-29T12:03:35.000Z",
          "wordCount": 264,
          "title": "newtonpermetersquare:So that’s basically how it went down"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652517901573783552",
          "author": null,
          "description": "digitaldiscipline:\n\nfullyfunctionalminiaturebeehive:\n\ngarbuge:\n\nearrings change your gender not like fully but they Change it\n\nThey’re a flavour enhancer, like salt or soy sauce.\n\nMSG (more substantial gender)",
          "link": "https://gfzoda.tumblr.com/post/652517901573783552",
          "publishedOn": "2021-05-29T11:59:23.000Z",
          "wordCount": 286,
          "title": "digitaldiscipline:fullyfunctionalminiaturebeehive:garbuge:earrings change your gender not like fully..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652448776910503936",
          "author": null,
          "description": "right-2-rebel:\n\np0stmarxed:\n\nOh okay up until now I’ve just thought Pacific Rim was an okay movie but after hearing Del Toro refused any Pentagon funding for it I’ve changed my mind what a great film",
          "link": "https://gfzoda.tumblr.com/post/652448776910503936",
          "publishedOn": "2021-05-28T17:40:41.000Z",
          "wordCount": 312,
          "title": "right-2-rebel:p0stmarxed:Oh okay up until now I&rsquo;ve just thought Pacific Rim was an okay movie..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652253593949421568",
          "author": null,
          "description": "wishfishy:\n\nrespectfulofwomen:\n\n\nJohn Brosio’s paintings exemplify what I truly mean when I say “it’s time for crab”.",
          "link": "https://gfzoda.tumblr.com/post/652253593949421568",
          "publishedOn": "2021-05-26T13:58:20.000Z",
          "wordCount": 271,
          "title": "wishfishy:respectfulofwomen:John Brosio’s paintings exemplify what I truly mean when I say “it’s..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652098974296178688",
          "author": null,
          "description": "acemer1in:\n\ntheprinceofsnark:\n\naskasexual:\n\noccasionally-gay:\n\nincessant-honking:\n\nbad-puns-n-finger-guns:\n\nice-dispenser:\nbad-puns-n-finger-guns:\n\n2boldlyqueer:\n\nsporkkles-irl:\n\nbill-nye-official-blog:\n\nice-dispenser:\n\nthings i’ll not call you a whore for:\n\nsexual activity\nhow you dress\n\nthings i’ll call you a whore for:\n\nstealing my food \nstealing my lemons\nmy cat likes you more than me\n\nwhy are lemons separate from food op?\n\neveryone knows lemons arent food\n\nlemon stealing whores are a huge issue separate from food stealing whores. there’s a whole documentary about whores stealing lemons from the trees of unsuspecting victims. you can see the first two minutes of it here.\n\n\n\nThats a rickroll. That totally is a fucking rickroll. No fukin way. Not falling for it.\n\ndude, trust me, that isn’t a rick roll. its something worse\n\n\n\nMe to the rest of tumblr after actually watching what was in the link:\n\n…I really don’t know what I was expecting.\n\n\n\nWhat the fuck did i just watch.\n\n\n\nIt- it’s not a Rick  roll \n\n\n\nHave we really reached a time when the Lemon Stealing Whores are no longer common knowledge.",
          "link": "https://gfzoda.tumblr.com/post/652098974296178688",
          "publishedOn": "2021-05-24T21:00:43.000Z",
          "wordCount": 420,
          "title": "acemer1in:theprinceofsnark:askasexual:occasionally-gay:incessant-honking:bad-puns-n-finger-guns:ice-d..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652077249951055872",
          "author": null,
          "description": "thetatteredveil:\n\nthetatteredveil:\n\nbooks had absolutely no right trying to tell me that swamp hags are villains. the older i get the more i can feel myself yearning to become that bitch baba yaga. i dont want skin and i dont want a system of commerce and currency i want moss for hair and a big bubbling cauldron\n\nto be clear yes i think swamp hags are evil im just saying that theyre right",
          "link": "https://gfzoda.tumblr.com/post/652077249951055872",
          "publishedOn": "2021-05-24T15:15:25.000Z",
          "wordCount": 347,
          "title": "thetatteredveil:thetatteredveil:books had absolutely no right trying to tell me that swamp hags are..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651838370549481472",
          "author": null,
          "description": "theywontletmebeprincipal:\n\ngirl you look like a bloodborne boss (complimentary)",
          "link": "https://gfzoda.tumblr.com/post/651838370549481472",
          "publishedOn": "2021-05-21T23:58:32.000Z",
          "wordCount": 277,
          "title": "theywontletmebeprincipal:girl you look like a bloodborne boss (complimentary)"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651664120250269696",
          "author": null,
          "description": "parakeet:\n\nparakeet:\n\nim eating the gemstones in the museum gift shop i like the taste",
          "link": "https://gfzoda.tumblr.com/post/651664120250269696",
          "publishedOn": "2021-05-20T01:48:54.000Z",
          "wordCount": 278,
          "title": "parakeet:parakeet:im eating the gemstones in the museum gift shop i like the taste"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651632105876504576",
          "author": null,
          "description": "ace-pervert:\n\nnerdi-author-girl:\nessoreese:\n\ncwicseolfor:\nmaculategiraffe:\nme, reaching into my dresser drawer for black pants: I hope this isn’t the pair with big holes worn in the inner thighs\nMarie Kondo, gently over my shoulder: why is a pair of pants you find unwearable still in your dresser drawer\nme: oh shit that’s right!!  The dresser is for clothes that under some circumstance I might conceivably wear!!\nMarie Kondo, beaming proudly: Yes, that’s correct!!  These pants must have been your favorites.  How wonderful that they were so comfortable and practical that you wore them out.  But now since they no longer function as pants, you should move them from the drawer where you keep your functioning pants!\nme: Yes thanks I got it they’re in the fabric basket now\nMarie Kondo, fading back into the darkness: I love what you’ve done with the kitchen!!\nThe notion of KonMari as some creepy semi-embodied but entirely benevolent spirit, like a well-intentioned Bloody Mary, is so perfect and wonderful. \nMarie Kondo has the same powers but the exact opposite energy of the Duolingo Owl.\nYES.\nMarie Kondo: Your room isn’t very clean, but that’s okay, I love mess! Does this spark joy?\nDuolingo Owl: I wrote the ransom note in Spanish, and if you have to use Google Translate to read it, your kid gets it. You broke your streak. I’ll break your neck.\n\n\nMarie Kondo holding your child, while standing on the remains of the Duolingo Owl : The Bird did not spark joy",
          "link": "https://gfzoda.tumblr.com/post/651632105876504576",
          "publishedOn": "2021-05-19T17:20:03.000Z",
          "wordCount": 510,
          "title": "ace-pervert:nerdi-author-girl:\n\nessoreese:\ncwicseolfor:\n\nmaculategiraffe:\n\nme, reaching into my..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651622627892396032",
          "author": null,
          "description": "my-gender-is:\nmy gender is 37 axolotls in a top hat",
          "link": "https://gfzoda.tumblr.com/post/651622627892396032",
          "publishedOn": "2021-05-19T14:49:24.000Z",
          "wordCount": 255,
          "title": "my-gender-is:\n\nmy gender is 37 axolotls in a top hat"
        }
      ]
    },
    {
      "title": "CuriosityConfusion",
      "feedUrl": "http://curiosityconfusion.tumblr.com/rss",
      "siteUrl": "https://curiosityconfusion.tumblr.com/",
      "articles": [
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654030174749360128",
          "author": null,
          "description": "murielswedding:\n\nthe thing about self love is you are already doing everything in your day to day to allow yourself to love yourself. if someone else charged your phone, you would appreciate that gesture. if someone else bought or cooked you a meal, you would appreciate that gesture. if someone else did your laundry, you would appreciate that gesture. all of those things are already acts of love to yourself. you don’t have to do anything more to be able to love yourself, you just have to reframe how you think about what you are already doing.",
          "link": "https://curiosityconfusion.tumblr.com/post/654030174749360128",
          "publishedOn": "2021-06-15T04:36:19.000Z",
          "wordCount": 329,
          "title": "murielswedding:the thing about self love is you are already doing everything in your day to day to..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653947950324695040",
          "author": null,
          "description": "tristaniseult:\n\ntristaniseult:\n\nlove looks like the mosaic from ancient rome about a race horse that says: “win or lose, we love you, polidoxus”\n\nlove looks like all the people across history who have cared for their pets and named them sweet things like much-beloved or lovely or precious or grain-of-gold. and commissioned for their likenesses to be carved or painted or made into mosaics. bc their affection was so much greater and grander than the constraints of a human lifetime. and some piece of those pets outlasted even their owners in the annals of history. like that’s love",
          "link": "https://curiosityconfusion.tumblr.com/post/653947950324695040",
          "publishedOn": "2021-06-14T06:49:24.000Z",
          "wordCount": 340,
          "title": "tristaniseult:tristaniseult:love looks like the mosaic from ancient rome about a race horse that..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653830860795248640",
          "author": null,
          "description": "elymaiis:\n\n“If you give a man a fish, he will eat for a day; if you teach a man to fish, he will eat for a lifetime,” but you have done neither. You have stood before us and eaten fish after fish, and chided us for our greed as you have done so. You have cast aside their offal and simultaneously chided us for our waste. You then told us that, coincidentally, you owned the river, and our parents should have gotten us the same if we wanted fish. You gave a man a fish to murder us if we step too close to the river, or speak too loud, or eat a fish from another river. You’ve copyrighted the fishing net. It costs us fish to leave.",
          "link": "https://curiosityconfusion.tumblr.com/post/653830860795248640",
          "publishedOn": "2021-06-12T23:48:19.000Z",
          "wordCount": 388,
          "title": "elymaiis:“If you give a man a fish, he will eat for a day; if you teach a man to fish, he will eat..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653753735325106176",
          "author": null,
          "description": "affectionatesuggestion:\nlet’s go get slurpies together and then go to a park and I’ll push you on the tire swing and we will laugh and laugh until our sides hurt",
          "link": "https://curiosityconfusion.tumblr.com/post/653753735325106176",
          "publishedOn": "2021-06-12T03:22:26.000Z",
          "wordCount": 269,
          "title": "affectionatesuggestion:\n\nlet’s go get slurpies together and then go to a park and I’ll push you on..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653730656964182016",
          "author": null,
          "description": "Has anyone else been getting this ad?? It’s like the only one I see, and I…honestly can’t figure out how to interpret it as anything but advocating for emotional abuse? What does it mean, if not “tired of yelling? Ignore your child until they feel like you don’t care about them!”\n???",
          "link": "https://curiosityconfusion.tumblr.com/post/653730656964182016",
          "publishedOn": "2021-06-11T21:15:37.000Z",
          "wordCount": 119,
          "title": "Has anyone else been getting this ad?? It&rsquo;s like the only one I see, and I&hellip;honestly..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653476111759589376",
          "author": null,
          "description": "birlinterrupted:\ni dont know why people are like ‘we need to bully people so they are more normal’ when if the internet has been anything its been a series of longitudinal studies showing that prolonged large scale bullying tends to lead people to becoming increasingly weird, paranoid, sometimes off-putting, traumatized, emotionally troubled, ethically disregulated, etc. even unethical modalities like behaviorism don’t focus exclusively or primarily on punishment. like people should literally just be honest and say they want more bullying because they like to do it and have fun hurting other people",
          "link": "https://curiosityconfusion.tumblr.com/post/653476111759589376",
          "publishedOn": "2021-06-09T01:49:44.000Z",
          "wordCount": 314,
          "title": "birlinterrupted:\n\ni dont know why people are like ‘we need to bully people so they are more normal’..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653457452285689856",
          "author": null,
          "description": "liv-abetic:\n\nI love that the two universal diabetic inside jokes that almost anyone with diabetes will understand, but must also seem weird to outsiders, are:\n1. Nobody changes their lancets\n2. The Insulin Compartment™️",
          "link": "https://curiosityconfusion.tumblr.com/post/653457452285689856",
          "publishedOn": "2021-06-08T20:53:09.000Z",
          "wordCount": 365,
          "title": "liv-abetic:I love that the two universal diabetic inside jokes that almost anyone with diabetes will..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653392546996830208",
          "author": null,
          "description": "cryptonature:\n\nVultures are holy creatures.\nTending the dead.\nBowing low.\nBared head.\nWhispers to cold flesh,\n“Your old name is not your king.\nI rename you ‘Everything.’”",
          "link": "https://curiosityconfusion.tumblr.com/post/653392546996830208",
          "publishedOn": "2021-06-08T03:41:30.000Z",
          "wordCount": 261,
          "title": "cryptonature:Vultures are holy creatures.Tending the dead.Bowing low.Bared head.Whispers to cold..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653300158218534912",
          "author": null,
          "description": "tr4shie:",
          "link": "https://curiosityconfusion.tumblr.com/post/653300158218534912",
          "publishedOn": "2021-06-07T03:13:01.000Z",
          "wordCount": 242,
          "title": "tr4shie:"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653295505451991040",
          "author": null,
          "description": "spotlessmy-deactivated20210523:\n\nthis was a great read. “Laziness Does Not Exist” by Devon Price",
          "link": "https://curiosityconfusion.tumblr.com/post/653295505451991040",
          "publishedOn": "2021-06-07T01:59:04.000Z",
          "wordCount": 248,
          "title": "spotlessmy-deactivated20210523:this was a great read. “Laziness Does Not Exist” by Devon Price"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653285154538831872",
          "author": null,
          "description": "sw-maddie:\n\nsw-maddie:\n\nthe pristine gay/trans experience of communicating to another queer person that you are also queer by specifically complimenting the queer-coded thing about their style\n\nand conversely, being complimented by another queer person on the specifically queer-coded thing about your own style",
          "link": "https://curiosityconfusion.tumblr.com/post/653285154538831872",
          "publishedOn": "2021-06-06T23:14:33.000Z",
          "wordCount": 285,
          "title": "sw-maddie:sw-maddie:the pristine gay/trans experience of communicating to another queer person that..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652848557009829888",
          "author": null,
          "description": "thelasagnamanifesto:\n\nthelasagnamanifesto:\n\nI hope you eat. I hope we both eat\n\nI am cooking. There is sign of food. You are coming to lunch with me. Fork in lovable hand.",
          "link": "https://curiosityconfusion.tumblr.com/post/652848557009829888",
          "publishedOn": "2021-06-02T03:35:01.000Z",
          "wordCount": 280,
          "title": "thelasagnamanifesto:thelasagnamanifesto:I hope you eat. I hope we both eatI am cooking. There is..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652840329220964352",
          "author": null,
          "description": "parliamentrook:\n\nAnd then it becomes part of the environment, That’s Just Where it Lives, until a bout of cleaning hyperfixation where you have to concentrate really hard on The Thing and the curse is broken.",
          "link": "https://curiosityconfusion.tumblr.com/post/652840329220964352",
          "publishedOn": "2021-06-02T01:24:14.000Z",
          "wordCount": 317,
          "title": "parliamentrook:And then it becomes part of the environment,..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652837763534766080",
          "author": null,
          "description": "castlesofcards:\n\nhere are some more flags i made with comic book newsprint textures :-) to get the textures i scanned real comics!",
          "link": "https://curiosityconfusion.tumblr.com/post/652837763534766080",
          "publishedOn": "2021-06-02T00:43:27.000Z",
          "wordCount": 253,
          "title": "castlesofcards:here are some more flags i made with comic book..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652808540228026368",
          "author": null,
          "description": "sonicrainbooms:\n\nhappy pride month i love being bisexual and defining myself as bisexual and i really like how bisexual sounds and the bisexual flag is very pretty",
          "link": "https://curiosityconfusion.tumblr.com/post/652808540228026368",
          "publishedOn": "2021-06-01T16:58:58.000Z",
          "wordCount": 271,
          "title": "sonicrainbooms:happy pride month i love being bisexual and defining myself as bisexual and i really..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652673205876752384",
          "author": null,
          "description": "glitter-and-popcorn:\n\noldshrewsburyian:\n\nbemusedlybespectacled:\n\nhazeldomain:\noganizediguana:\nlauraantoniou:\nlastxleviathan:\nrobotmango:\ntsunderepup:\nrandomslasher:\npastel-selkie:\nlesbianshepard:\nstupid leftists and their belief in *checks notes* the intrinsic value of human life\n\n\nReblog if you would burn down the statue of liberty to save a life\nHere’s the thing, though. If you asked a conservative “Would you let the statue of liberty burn to save one life?” they’d probably scoff and say no, it’s a national landmark, a treasure, a piece of too much historical importance to let it be destroyed for the sake of one measly life. \nBut if you asked, “Would you let the statue of liberty burn in order to save your child? your spouse? someone you loved a great deal?” the tune abruptly changes. At…",
          "link": "https://curiosityconfusion.tumblr.com/post/652673205876752384",
          "publishedOn": "2021-05-31T05:07:53.000Z",
          "wordCount": 1965,
          "title": "glitter-and-popcorn:oldshrewsburyian:bemusedlybespectacled:\nhazel..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652579097701187584",
          "author": null,
          "description": "bagginshield:\n\nbagginshield:\n\nsomething about needless tragedy when its effectively written and how it works SO well. boromir taking like seven arrows to the chest and continuing to fight and it doesnt save merry and pippin. the fact that merry and pippin were needlessly taken bc the uruks thought they had the ring, which they didnt. there are people in this war willingly sacrificing themselves to distract sauron from frodo and then there are people given no time to think through a plan, doing the best with the few seconds they have and dying with the hope that their actions will protect the people they love. and sometimes it doesnt. boromirs epic final stand did not actually matter, did not give the hobbits a chance to escape. but his final breaths were given with love nonetheless.\n\nsometimes heroism is not in whether or not your actions actually save people, sometimes the glory is simply in the desperate and heartfelt trying",
          "link": "https://curiosityconfusion.tumblr.com/post/652579097701187584",
          "publishedOn": "2021-05-30T04:12:04.000Z",
          "wordCount": 408,
          "title": "bagginshield:bagginshield:something about needless tragedy when its effectively written and how it..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/652577765592334336",
          "author": null,
          "description": "bi-demonboi:",
          "link": "https://curiosityconfusion.tumblr.com/post/652577765592334336",
          "publishedOn": "2021-05-30T03:50:54.000Z",
          "wordCount": 248,
          "title": "bi-demonboi:"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651943493806227456",
          "author": null,
          "description": "I am drunk and holy shit I want attention so bad. Message me? Or send me asks? Or just like this post? Validate my existence? Please?",
          "link": "https://curiosityconfusion.tumblr.com/post/651943493806227456",
          "publishedOn": "2021-05-23T03:49:25.000Z",
          "wordCount": 133,
          "title": "I am drunk and holy shit I want attention so bad. Message me? Or send me asks? Or just like this..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651941419275124736",
          "author": null,
          "description": "closet-keys:\n\nIt’s extremely weird how comfortable people are with violence if it wears a police uniform. Like someone who would be afraid to even raise their voice against a customer and would never dream of shoving someone in intimidation in any situation is somehow simultaneously okay with asking someone to go up and threaten them with a loaded gun and drag them out of the building. If cops weren’t normalized and it was just some random guy, they’d never do it. They wouldn’t turn to their coworker and say “that person’s breaking the store policy, can you take this loaded gun and chase him out of here?” I wish I could snap people out of this cognitive dissonance they have where violence doesn’t count if it comes with a badge.",
          "link": "https://curiosityconfusion.tumblr.com/post/651941419275124736",
          "publishedOn": "2021-05-23T03:16:27.000Z",
          "wordCount": 365,
          "title": "closet-keys:It’s extremely weird how comfortable people are with violence if it wears a police..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651939753024978944",
          "author": null,
          "description": "ana-bolism:\n\nana-bolism:\n\nYou know what? I don’t want neurotypicals to see me as “normal.” I want them to be okay with my wackiness.\n\nI want them to be okay with autistic people being fucking weird when that’s what we are! I don’t want you to suddenly dismiss our unique behaviours. I want you to be okay with the fact I go extended amounts of time without talking. I want you to be okay with the fact I move my arms in a weird way. I want you to be okay with the fact I will be in genuine pain if I hear that seemingly harmless noise just one more time. I want neurotypicals to be okay with the fact that sometimes, they WILL find autistic people wacky and that we STILL deserve respect regardless.",
          "link": "https://curiosityconfusion.tumblr.com/post/651939753024978944",
          "publishedOn": "2021-05-23T02:49:58.000Z",
          "wordCount": 371,
          "title": "ana-bolism:ana-bolism:You know what? I don’t want neurotypicals to see me as “normal.” I want them..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651717457724211200",
          "author": null,
          "description": "foreverravenclaw:\n\nWhy do little kids get all the cool clothes?? What if I want a shirt with a \n\nstegosaurus driving an excavator on it?? Huh, why does the fashion industry not think about that??",
          "link": "https://curiosityconfusion.tumblr.com/post/651717457724211200",
          "publishedOn": "2021-05-20T15:56:40.000Z",
          "wordCount": 272,
          "title": "foreverravenclaw:Why do little kids get all the cool clothes?? What if I want a shirt with..."
        }
      ]
    }
  ],
  "cliVersion": "1.10.2"
}