{
  "sources": [
    {
      "title": "Dwarf Fortress Development Log",
      "feedUrl": "http://www.bay12games.com/dwarves/dev_now.rss",
      "siteUrl": "http://www.bay12games.com/dwarves/index.html",
      "articles": [
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-06-25",
          "author": null,
          "description": "(Toady One) The \r\n\t\r\n\t\tSteam news from last week\r\n\t\r\n has the trade screen image I showed here, but also vertical bars and a floodgate with some flowing water.\r\n\n\r\nAs we started to think about labor and military stuff, it became natural to just put it all into an info screen with various tabs.  So far I've mostly finished up the coding on the creatures and tasks tabs, which cover the old 'u'nit and 'j'obs screens (aside from the manager, which is now its own tab).  The new creatures tab also covers the animals section of the old 'z' status screens, and the main unit list also has a stress readout so you can easily figure out who is having trouble.\r\n\n\r\nLate last April, Zach and Annie also welcomed Princess Josephine of the Northern Lighthouse into their home!  Jojo is very small.  She is also fierce and ridiculous.",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-06-25",
          "publishedOn": "2021-06-25T20:56:00.000Z",
          "wordCount": 13821,
          "title": "06/25/2021"
        },
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-06-15",
          "author": null,
          "description": "(Toady One) Here's \r\n\t\r\n\t\tthe last Steam News, concerning beekeeping\r\n\t\r\n, from earlier this month.\r\n\n\r\nSince then, I've mostly been working on the trade screen.  It's basically at a good spot now, though there are various bits that could be added, probably most notably the ability to view items again (it's not compatible with how we have our item sheets set up now, but I can work through it), and a few new lines of text to make the hidden haggling mechanics a little more sensible (to new players, counter-offers feel like they trigger at random, but it's actually based on skill rolls vs. profit/mood, etc.)  Also notably, there are item string filters now.  The little merchant in the top left is so low because creatures can be 64 pixels tall now, and dwarves can even be taller than 32 pixels if they have the right hair style, I think, but I'll probably adjust the positioning for smaller creatures before the end.  These sorts of things add up to make each of these screen rewrites take longer than expected, but another one down brings us that much closer.\r\n\n\r\nNext up we'll probably be looking at finishing the labor rewrite, the workshop profiles, and then how that all connects up e.g. to the military stuff (through e.g. civilian item assignments.)  That's also bound to get a little messy, ha ha.",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-06-15",
          "publishedOn": "2021-06-16T01:10:00.000Z",
          "wordCount": 13676,
          "title": "06/15/2021"
        }
      ]
    },
    {
      "title": "fite me",
      "feedUrl": "https://pseudoartist.tumblr.com/rss",
      "siteUrl": "https://pseudoartist.tumblr.com/",
      "articles": []
    },
    {
      "title": "One Thing Well",
      "feedUrl": "http://onethingwell.org/rss",
      "siteUrl": "https://onethingwell.org/",
      "articles": []
    },
    {
      "title": "jwz",
      "feedUrl": "http://www.jwz.org/blog/feed/",
      "siteUrl": "https://www.jwz.org/blog/",
      "articles": [
        {
          "id": "https://jwz.org/b/yjoj",
          "author": "jwz",
          "description": "mateosfo: \"Wet bulb\" temperature is the temperature + relative humidity at which water stops evaporating off a \"wet\" thermometer bulb. If air is sufficiently humid (saturated w/ water vapor), evaporation will no longer cool the bulb, and it gets continuously hotter. [...] Dry air has essentially infinite capacity to absorb moisture, so, humans can survive in very high temps if the air is dry [...] But, the wet bulb is not about heat, per se. It's about the absorptive capacity of air. A wet bulb temperature in the mid-80s F can, and does, kill humans. Heat waves in the EU & Russia in 2003 and 2010 killed over a hundred thousand people at ~ 82 F. [...] If sweat won't evaporate, our body temp rises, continuously. And when body temp hits ~108, we're dead. For a vulnerable person in wet bulb te…",
          "link": "https://www.jwz.org/blog/2021/06/wet-bulb-temperature/",
          "publishedOn": "2021-07-01T04:45:11.000Z",
          "wordCount": 2419,
          "title": "Wet Bulb Temperature"
        },
        {
          "id": "https://jwz.org/b/yjoi",
          "author": "jwz",
          "description": "Worst issue of \"Marvel Team-Up\" Ever.",
          "link": "https://www.jwz.org/blog/2021/06/worst-issue-of-marvel-team-up-ever/",
          "publishedOn": "2021-06-28T19:02:42.000Z",
          "wordCount": 681,
          "title": "Worst issue of \"Marvel Team-Up\" Ever.",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/jesusandspiderman.mp4",
            "length": "177462",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjoh",
          "author": "jwz",
          "description": "\"Wilma! Where'd you put my electric drill!\" DentalSlim Diet Control is an intra-oral device fitted by a dental professional to the upper and lower back teeth. It uses magnetic devices with unique custom-manufactured locking bolts. It allows the wearer to open their mouths only about 2mm, restricting them to a liquid diet, but it allows free speech and doesn't restrict breathing. [...] The practice of surgically wiring people's jaws shut became popular in the 1980s, but it came with risks; vomiting brought with it the risk of choking and after 9 to 12 months the patients developed gum disease. In some cases, there were continuing issues with restriction of jaw movement and some developed acute psychiatric conditions. [...] \"The beauty of it is that once patients are fitted with the device, after two or three weeks they can have the magnets disengaged. They could then have a period with a less restricted diet and then go back into treatment,\" he says. [...] Patients are given a tool to open the device in an emergency, but none of the study participants needed to use it. Can't wait until these get 0wnz0red like the internet dick cage.",
          "link": "https://www.jwz.org/blog/2021/06/lowjack-lockjaw/",
          "publishedOn": "2021-06-28T18:20:29.000Z",
          "wordCount": 811,
          "title": "Lowjack Lockjaw"
        },
        {
          "id": "https://jwz.org/b/yjog",
          "author": "jwz",
          "description": "When everybody gets to be a princess: Located approximately halfway between Istanbul and Ankara, the empty town consists of hundreds of almost identical castles in various states of completion. Developers meant for these uniform villas to be luxury vacation homes for wealthy tourists when they began construction in 2014. However, when the company went bankrupt in 2018, investors pulled out of the deal which put construction on hold. The development cost a cool $200 million to build thus far. But instead of a grandiose, multi-million dollar retreat, Burj al Babas has become something out of a dystopian novel. [...] \"We only need to sell 100 villas to pay off our debt,\" said Mezher Yerdelen, deputy chair of the Sarot Property Group. \"I believe we can get over this crisis in four to five months and partially inaugurate the project in 2019.\"",
          "link": "https://www.jwz.org/blog/2021/06/this-place-is-not-a-place-of-honor-3/",
          "publishedOn": "2021-06-24T18:36:28.000Z",
          "wordCount": 854,
          "title": "This Place is not a Place of Honor",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/5dr1pjije8dywom1.mp4",
            "length": "36851155",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjof",
          "author": "jwz",
          "description": "Sometimes autocomplete makes you really feel seen: And sometimes it's nothing but WTF: The primary completion, \"Lisa R\", is someone I have not exchanged email with in probably 15 years. \"Lisa H\" is someone I email multiple times a day. They're not even alphabetical!!",
          "link": "https://www.jwz.org/blog/2021/06/great-moments-in-autocomplete/",
          "publishedOn": "2021-06-22T21:03:43.000Z",
          "wordCount": 654,
          "title": "Great moments in autocomplete"
        },
        {
          "id": "https://jwz.org/b/yjoe",
          "author": "jwz",
          "description": "California man stole 42,000 pounds of pistachios: Nuts are an ideal high-priced items to steal and resell because unlike electronic devices, pistachios don't have serial numbers -- making them virtually untraceable. [...] Thieves have used forged documents, fake companies and computer hacking to pose as legitimate truckers. Similarly, the thieves are also able to sell off the product to retailers, who are none the wiser about who is actually receiving the money. [...] When detectives inspected the truck, they found the pistachios siphoned into 2,000-pound sacks -- making it easier for resale, police said. DickKingSmith: Spider monkeys flee the crime scene after committing what we can only assume is some sort of high-rise fruit heist.",
          "link": "https://www.jwz.org/blog/2021/06/today-in-nut-heist-news/",
          "publishedOn": "2021-06-22T18:23:29.000Z",
          "wordCount": 666,
          "title": "Today in Nut Heist News",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/fpzwbbctivpg9sfa-2.mp4",
            "length": "331083",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjod",
          "author": "jwz",
          "description": "Our opening weekend was amazing! All of the events were really fun, and packed. It's nice to be back. The thing that struck me most about our Friday night re-opening party, Turbo Drive, was that it wasn't the usual Turbo Drive crowd. I got the impression that a lot of people said to themselves, \"I don't know what synthwave is, but I'm going anyway.\" And they stuck around, too! Also they all dressed up, but everyone dressed up for a different party. Here's a girl dressed for the symphony, here's a guy dressed for a punk show in 1977, here's Lara Croft swing dancing with Snake Plissken. I very much hope that this wasn't a one-off and that people hold on to that attitude: \"I don't know what this is, but let's check it out anyway\". Nature is healing and you are allowed to try new things. Then Saturday, we had three events: the early show was Hubba Hubba Revue, followed by Bootie in the main room and Lower Underground in Above DNA. The audiences for these parties were more traditional; it was the usual Hubba, Bootie and dubstep/rave crowds, but, there were nearly twice as many of them as in the Before Times, which was awesome. I had wondered whether people would stil be skittish about being in crowds, and the answer to that is, NOPE. They were happy being absolutely packed in, sweating all over each other. Though all our staff are still wearing masks, I'd say that less than 1% of the customers were. No soft re-entry here: they have embraced the Full Florida. I also very much expected to see some people getting seriously sloppy by about 1am, since everyone is out of practice at drinking in public, but nope again: they mostly held their shit together pretty well! Good form, SF. Our crew were all pretty exhausted by the end. It's going to take a little while to get our sea legs back. And also we are still hiring -- bartenders, security, restaurant and floor. Email jobs@dnalounge.com. Tonight: The Return of Death Guild! Bereft (I am reliably informed) in deathly bloom.",
          "link": "https://www.dnalounge.com/backstage/log/2021/06/21.html",
          "publishedOn": "2021-06-21T21:41:42.000Z",
          "wordCount": 690,
          "title": "DNA Lounge: Wherein we did the thing"
        },
        {
          "id": "https://jwz.org/b/yjoc",
          "author": "jwz",
          "description": "See More Evil: \"The sociopath sack race is important to me. To do my part, I left one or two of these around New York.\"",
          "link": "https://www.jwz.org/blog/2021/06/election-endorsements/",
          "publishedOn": "2021-06-21T18:14:23.000Z",
          "wordCount": 522,
          "title": "Election Endorsements"
        },
        {
          "id": "https://jwz.org/b/yjob",
          "author": "jwz",
          "description": "I'm not going to link to the article, but I will just note that it is journalistic malpractice that this headline says \"cow poo\" instead of \"bullshit\". I mean, the article that I am not linking to contains other acts of journalistic malpractice as well (credulity, publishing a company press release, pretending that the opinions of billionaire celebrities matter) but the headline is really the cherry on this bullshit sundae.",
          "link": "https://www.jwz.org/blog/2021/06/today-in-dunning-krugerrand-news-5/",
          "publishedOn": "2021-06-21T17:57:44.000Z",
          "wordCount": 610,
          "title": "Today in Dunning-Krugerrand news"
        },
        {
          "id": "https://jwz.org/b/yjoa",
          "author": "jwz",
          "description": "Dear Lazyweb, As I've got a stack of otherwise-useless old iPads lying around, I'd like to use them for signage: load a web page playing an MP4, don't let the user click on anything. \"Guided Access\" sounds like it is made for this, but I keep coming back a day or two later and the screen is blanked. It's on wall power and battery is at 100%. Any ideas? Also you can't hide the Safari title bar, which is slightly annoying. There are a ton of \"digital signage\" apps out there on the app store, but that's a spam-heavy SEO-poisoned concept to search for so I can't tell if any of them actually do anything that I care about that \"Safari displaying a web page\" doesn't already do.",
          "link": "https://www.jwz.org/blog/2021/06/ipads-as-signage/",
          "publishedOn": "2021-06-20T19:00:22.000Z",
          "wordCount": 1013,
          "title": "iPads as signage"
        },
        {
          "id": "https://jwz.org/b/yjoZ",
          "author": "jwz",
          "description": "The ETA Aquariids were towards the end of their shower on May 27, while the Arietids were at their beginning, so it could have been from either. Both tend to be more visible before dawn. Given that the image was snapped at 11:07 pm local time, the former might be more likely than the latter. The Arietids is one of the most intense meteoroids streams with up to 60 shooting stars an hour but most of them streak through the sky during the daytime so we don't see them.",
          "link": "https://www.jwz.org/blog/2021/06/volcano-fortress-versus-meteor-fight/",
          "publishedOn": "2021-06-14T19:53:30.000Z",
          "wordCount": 617,
          "title": "Volcano Fortress versus Meteor: Fight!"
        },
        {
          "id": "https://jwz.org/b/yjoY",
          "author": "jwz",
          "description": "Not even Catwoman pussy. \"In the third season of 'Harley Quinn' we had a moment where Batman was going down on Catwoman. And DC was like, 'You can't do that. You absolutely cannot do that.' They're like, 'Heroes don't do that.' So, we said, 'Are you saying heroes are just selfish lovers?' They were like, 'No, it's that we sell consumer toys for heroes. It's hard to sell a toy if Batman is also going down on someone.'\" The duo compares the series to \"The Mary Tyler Moore Show\" -- \"if Mary killed a bunch of people\".",
          "link": "https://www.jwz.org/blog/2021/06/heroes-dont-eat-pussy/",
          "publishedOn": "2021-06-14T19:29:50.000Z",
          "wordCount": 625,
          "title": "Heroes don't eat pussy."
        },
        {
          "id": "https://jwz.org/b/yjoX",
          "author": "jwz",
          "description": "Aaaaahhhhhh it's almost time!! Thanks to another extremely generous donor, we were able to re-surface the main stage, in the same manner as the dance floor! For the first time in the stage's 32 year life, it is actuallly level, and that weird bump in the middle (from a solitary glass block that used to poke through) is gone. Last year I put out a call for people who wanted to paint murals on some of our blank walls, but nothing really came of that, so last week I painted some chevrons on the balcony: I'd still like to get something painted on the walls inside the DNA Pizza and Above DNA restrooms, if only to cut down on the tagging. If you want to volunteer, let us know! Oh yeah, and since I mentioned last week that we could maybe give some old chandeliers a good home, three have shown up …",
          "link": "https://www.dnalounge.com/backstage/log/2021/06/14.html",
          "publishedOn": "2021-06-14T18:53:34.000Z",
          "wordCount": 823,
          "title": "DNA Lounge: Wherein we re-open in FOUR DAYS!"
        },
        {
          "id": "https://jwz.org/b/yjoW",
          "author": "jwz",
          "description": "Please enjoy jwz mixtape 228.",
          "link": "https://www.jwz.org/blog/2021/06/jwz-mixtape-228/",
          "publishedOn": "2021-06-13T16:57:46.000Z",
          "wordCount": 548,
          "title": "jwz mixtape 228"
        },
        {
          "id": "https://jwz.org/b/yjoV",
          "author": "jwz",
          "description": "Diver Nearly Swallowed By Humpback Whale: \"I was in his closed mouth for about 30 to 40 seconds before he rose to the surface and spit me out,\" Packard wrote. \"I am very bruised up but have no broken bones.\" [...] \"To be clear, the whale did not want him in its mouth,\" Kerr added, comparing the situation to an open-mouthed biker accidentally inhaling a fly.",
          "link": "https://www.jwz.org/blog/2021/06/to-be-clear-the-whale-did-not-want-him-in-its-mouth/",
          "publishedOn": "2021-06-13T06:06:50.000Z",
          "wordCount": 651,
          "title": "\"To be clear, the whale did not want him in its mouth\""
        },
        {
          "id": "https://jwz.org/b/yjoU",
          "author": "jwz",
          "description": "NullMemories:",
          "link": "https://www.jwz.org/blog/2021/06/spent-fuel-pools/",
          "publishedOn": "2021-06-12T18:55:39.000Z",
          "wordCount": 543,
          "title": "Spent Fuel Pools"
        },
        {
          "id": "https://jwz.org/b/yjoS",
          "author": "jwz",
          "description": "How the Web became unreadable",
          "link": "https://www.jwz.org/blog/2021/06/how-the-web-became-unreadable/",
          "publishedOn": "2021-06-12T17:28:10.000Z",
          "wordCount": 582,
          "title": "How the Web became unreadable"
        },
        {
          "id": "https://jwz.org/b/yjoR",
          "author": "jwz",
          "description": "\"Ultimate Slip 'N Slide\" Production Shut Down Over Explosive Diarrhea. The upcoming TV competition series has shut down indefinitely after up to 40 crew members fell violently ill during production on a remote ranch in Simi Valley, California. The outbreak of \"awful explosive diarrhea\" left people \"collapsing\" on set and \"being forced to run into port-o-potties.\" [...] According to an insider, many original crew members are reluctant to return to the shoot and blame the production for not ensuring that fresh, clean water was used on set. Plus side, maybe Ow My Balls will get picked up for a full season.",
          "link": "https://www.jwz.org/blog/2021/06/shitshow/",
          "publishedOn": "2021-06-12T17:23:49.000Z",
          "wordCount": 686,
          "title": "Shitshow"
        },
        {
          "id": "https://jwz.org/b/yjoQ",
          "author": "jwz",
          "description": "I always enjoy it when people tell on themselves with their font changes, making it clear that they have sent a hastily-edited form letter rather than a sincere one-to-one communication. Here's what a recent email looked like when viewed in Mail on iOS: And here's what it looked like in Mail on macOS. The difference is more subtle, but the text of [MAJOR METROPOLITAN AREA] is still smaller (capital letters are 25px instead of 28px). Also one of them is Arial and the other is Helvetica. Now, I know what you're thinking -- normally when someone makes that distinction you know that you're dealing with some kind of font-hipster super-nerd. This is true. But when they're side by side, sometimes even normal people can tell them apart! Here's an easy way to screw up like this on macOS: Compose an…",
          "link": "https://www.jwz.org/blog/2021/06/unintentional-forensic-edit-logs-via-font-changes/",
          "publishedOn": "2021-06-11T17:47:30.000Z",
          "wordCount": 993,
          "title": "Unintentional forensic edit logs via font changes"
        },
        {
          "id": "https://jwz.org/b/yjoP",
          "author": "jwz",
          "description": "Rep. Louie Gohmert (R-TX) asks whether the Forest Service or the BLM can alter the orbit of the moon or the Earth in order to fight climate change during a House Natural Resources hearing. \"I would have to follow up with you on that, Mr. Gomert.\"",
          "link": "https://www.jwz.org/blog/2021/06/chrome-the-moon-for-a-brighter-tomorrow/",
          "publishedOn": "2021-06-09T17:28:43.000Z",
          "wordCount": 821,
          "title": "Chrome The Moon for a Brighter Tomorrow!",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/78e12mrt1qxgm9gf.mp4",
            "length": "1499361",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjoO",
          "author": "jwz",
          "description": "XScreenSaver 6.01 is out now. This is an X11-only maintenance release, so there are no macOS, iOS or Android packages this time around. The 6.00 refactor of the X11 XScreenSaver daemon has so far proven to be very stable and secure! The bugs fixed in this release are relatively minor. However: If you are using 6.00, I strongly recommend upgrading to 6.01. If you are using 5.xx, I strongly, strongly recommend upgrading to 6.01. Sadly, due to recent catastrophic decision-making on the part of certain Linux distros, I was forced to add the following section to the XScreenSaver manual: THE WAYLAND PROBLEM Wayland is a completely different window system that is intended to replace X11. After 13+ years of trying, some Linux distros have finally begun enabling it by default. Most deployments of it also include XWayland, which is a compatibility layer that allows some X11 programs to continue to work within a Wayland environment. Unfortunately, XScreenSaver is not one of those programs. If your system is running XWayland, XScreenSaver will malfunction in two ways: It will be unable to detect user activity in non-X11 programs. This means that while a native Wayland program is selected, XScreenSaver will think that you are idle, and may blank the screen prematurely. It will be unable to lock the screen. This is because X11 grabs don't work properly under XWayland, so there is no way for XScreenSaver to prevent the user from switching away from the screen locker to another application. If you are aware of some way for XScreenSaver to reliably detect user activity under Wayland, do let me know. Maybe there is some dbus/systemd signal that I have missed? Now that the XScreenSaver 6.x daemon has been sandboxed and massively reduced in size, it might be plausible for someone to rewrite xscreensaver.c to speak Wayland instead of X11, to run inside the Wayland compositor, and then to launch the X11 programs xscreensaver-auth and xscreensaver-gfx as needed. But that someone will not be me.",
          "link": "https://www.jwz.org/blog/2021/06/xscreensaver-6-01-out-now/",
          "publishedOn": "2021-06-09T16:34:45.000Z",
          "wordCount": 969,
          "title": "XScreenSaver 6.01 out now"
        },
        {
          "id": "https://jwz.org/b/yjoN",
          "author": "jwz",
          "description": "One of life's simple joys is pointing a video camera at a TV. We should all do that more often. We recently got a screaming deal on this gargantuan 75\" TV, so we turned it into an instagram trap under the main stairs. I think it's going to be very popular! \"What software does it use?\" None, it uses none software. Video feedback works better if it stays in the analog domain, as with 30+ year old camcorders and CRTs rather than that four letter word \"HDMI\", but one does what one can. Hey, here's an interior decoration project maybe one of you could help us out with. The Green Room, that room to the South of the Lounge that you enter from the stage-left stairs, has always been less inviting than we'd like. People treat it as more of a hallway than as a place to hang out. I think it could use a bunch of overstuffed thrift-shop couches and chairs -- really gaudy stuff -- and also a shitload of chandeliers. It has a surprisingly high ceiling, and I think that filling that space with dozens of chandeliers might look pretty cool. So, if you are a person who already has the hobby of frequenting thrift shops and estate sales, I'd love to give you a small monthly budget for broken down chandeliers and couches to dress up that room. (The couches, I assume, won't long survive contact with the enemy and will need to be periodically replenished.)",
          "link": "https://www.dnalounge.com/backstage/log/2021/06/06.html",
          "publishedOn": "2021-06-06T17:34:46.000Z",
          "wordCount": 653,
          "title": "DNA Lounge: Wherein we value your feedback"
        },
        {
          "id": "https://jwz.org/b/yjoK",
          "author": "jwz",
          "description": "Caring For Your Geriatric Millennial",
          "link": "https://www.jwz.org/blog/2021/06/caring-for-your-geriatric-millennial/",
          "publishedOn": "2021-06-04T19:48:50.000Z",
          "wordCount": 622,
          "title": "Caring For Your Geriatric Millennial"
        },
        {
          "id": "https://jwz.org/b/yjoI",
          "author": "jwz",
          "description": "Truck full of traffic lights.",
          "link": "https://www.jwz.org/blog/2021/06/using-ritual-magic-to-trap-self-driving-cars-2/",
          "publishedOn": "2021-06-03T21:06:40.000Z",
          "wordCount": 698,
          "title": "Using Ritual Magic to Trap Self-Driving Cars",
          "enclosure": {
            "url": "https://www.jwz.org/images/2021/wkhklg_6qvphsxcg.mp4",
            "length": "422829",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://jwz.org/b/yjoH",
          "author": "jwz",
          "description": "Prayer Posts: Facebook confirmed that the social media platform is currently testing the prayer post feature. \"Our mission to give people the power to build community extends to the world's largest community; the faith community,\" Nona Jones, head of Global Faith Partnerships at Facebook, said in a written statement to Religion News Service. (I can't find any source for these important informations from a site without 'Christian' or 'Religion' in its name, so this may be bullshit.)",
          "link": "https://www.jwz.org/blog/2021/06/and-you-will-know-my-name-is-the-lord-when-you-accept-my-tracking-cookie/",
          "publishedOn": "2021-06-03T17:07:12.000Z",
          "wordCount": 930,
          "title": "And you will know my name is THE LORD when you accept my TRACKING COOKIE"
        }
      ]
    },
    {
      "title": "Trivium",
      "feedUrl": "http://chneukirchen.org/trivium/index.atom",
      "siteUrl": "https://leahneukirchen.org/trivium/",
      "articles": [
        {
          "id": "https://leahneukirchen.org/trivium/2021-06-20",
          "author": null,
          "description": "Let’s Encrypt: certificate lifetimes 90 days plus one second,\n“However, RFC 5280 defines the validity period of a certificate as\nbeing the duration between the “not before” and the “not after”\ntimestamps, inclusive. This inclusivity means that Let’s Encrypt’s\ncertificates have all been actually valid for 90 days plus 1 second.”\nCryptanalysis of the GPRS Encryption Algorithms GEA-1 and GEA-2, by\nChristof Beierle, Patrick Derbez, Gregor Leander, Gaëtan Leurent,\nHåvard Raddum, Yann Rotella, David Rupprecht, and Lukas Stennes.\n“The attack on GEA-1 is based on an exceptional interaction of the\ndeployed LFSRs and the key initialization, which is highly unlikely to\noccur by chance.”\nCelebrating 30 years of Europe’s first root name server,\n“In 1991, the Nordic University Network (NORDUnet) was selected to\noperate the first root name server in Europe.”\nFitting a FORTH in 512 bytes, really good write-up\nhow to implement a Forth on x86 by Jakub Kądziołka.\nGently down the stream, a gentle introduction to Apache Kafka\nwritten and illustrated by Mitch Seymour.  Absolutely adorable.\nARTSEY is a one-handed keyboard system using 8 keys in a 2x4 layout.\nGXemul is a framework for full-system computer architecture emulation.\nCan emulate Motorola 88K.\nCreation of Internet Relay Chat Nicknames and Their Usage in English\nChatroom Discourse (2011), by Robert Ecker.\nDaedalus: Man’s Greatest Flight,\nflying from Knossos to Santorini in a human-powered aircraft, in 1988.\nBuilding telemetry for tea aka Tealemetry (2018), by Ben Cox.\nKaboom, a cruel but fair Minesweeper implementation.\n“If you try to guess, the game will always choose the worst scenario.”",
          "link": "https://leahneukirchen.org/trivium/2021-06-20",
          "publishedOn": "2021-06-20T20:35:49.000Z",
          "wordCount": 270,
          "title": "20jun2021"
        },
        {
          "id": "https://leahneukirchen.org/trivium/2021-06-06",
          "author": null,
          "description": "Cores that don’t count (PDF),\nby Peter H. Hochschild, Paul Turner, Jeffrey C. Mogul,\nRama Govindaraju, Parthasarathy Ranganathan, David E. Culler, and Amin Vahdat.\n“As fabrication pushes towards smaller feature sizes and more\nelaborate computational structures, and as increasingly specialized\ninstruction-silicon pairings are introduced to improve performance, we\nhave observed ephemeral computational errors that were not detected\nduring manufacturing tests. These defects cannot always be mitigated\nby techniques such as microcode updates, and may be correlated to\nspecific components within the processor, allowing small code changes\nto effect large shifts in reliability. Worse, these failures are often\n“silent” – the only symptom is an erroneous computation.”\nOh no.\nUnix Shell Programming: The Next 50 Years (PDF),\nby Michael Greenberg, Konstantinos Kallas, and Nikos Vasilakis.\nM1ssing Register Access Controls Leak EL0 State,\nM1RACLES (CVE-2021-30747) is a covert channel vulnerability in the\nApple Silicon “M1” chip.\nA metalanguage for multi-phase modularity (PDF),\nby Jonathan Sterling and Robert Harper.\nHalf a year of the Liquid Tensor Experiment: Amazing developments,\nby Peter Scholze.\nIntroduction to Univalent Foundations of Mathematics with Agda,\nby Martín Hötzel Escardó.\n“We introduce Voevodsky’s univalent foundations and univalent\nmathematics, and explain how to develop them with the computer system\nAgda, which is based on Martin-Löf type theory.”\nA Short Introduction to Categorical Logic (YouTube),\nby Evan Patterson at the Topos Institute.\nJoseph Weizenbaum’s Original ELIZA, Computer Conversations (1965).\nThe Sweden Solar System is the world’s largest permanent scale model\nof the Solar System. The model represents the Solar System on the\nscale of 1:20 million.",
          "link": "https://leahneukirchen.org/trivium/2021-06-06",
          "publishedOn": "2021-06-06T19:00:46.000Z",
          "wordCount": 269,
          "title": "06jun2021"
        }
      ]
    },
    {
      "title": "Lambda the Ultimate - Programming Languages Weblog",
      "feedUrl": "http://lambda-the-ultimate.org/rss.xml",
      "siteUrl": "http://lambda-the-ultimate.org",
      "articles": [
        {
          "id": "http://lambda-the-ultimate.org/introducing-google-path-query",
          "author": null,
          "description": "Introducing PathQuery, Google's Graph Query Language\nWe introduce PathQuery, a graph query language developed to scale with Google's query and data volumes as well as its internal developer community. PathQuery supports flexible and declarative semantics. We have found that this enables query developers to think in a naturally \"graphy\" design space and to avoid the additional cognitive effort of coordinating numerous joins and subqueries often required to express an equivalent query in a relational space. Despite its traversal-oriented syntactic style, PathQuery has a foundation on a custom variant of relational algebra -- the exposition of which we presently defer -- allowing for the application of both common and novel optimizations. We believe that PathQuery has withstood a \"test of time\" at Google, under both large scale and low latency requirements. We thus share herein a language design that admits a rigorous declarative semantics, has scaled well in practice, and provides a natural syntax for graph traversals while also admitting complex graph patterns.\n\nThings that are somewhat interesting to me, from an engineering standpoint:\n1. PathQuery has a module/compilation system, enabling re-use of PathQuery modules across projects.  (Someone had mentioned that Google has around 40,000 PathQuery modules already, internally...)\nAlso, from a socio-linguistic perspective, Graph Languages are effectively the new Object-Relational Mapping layer, but they solve an interesting organizational problem of allowing multiple teams to code in different languages, without needing to re-write / re-implement entities and mapping configurations in each language.  It's the Old New Thing again...",
          "link": "http://lambda-the-ultimate.org/introducing-google-path-query",
          "publishedOn": "2021-06-30T13:23:37.000Z",
          "wordCount": 569,
          "title": "Introducing PathQuery, Google's Graph Query Language"
        }
      ]
    },
    {
      "title": "*incoherent yelling about worms*",
      "feedUrl": "http://gfzoda.tumblr.com/rss",
      "siteUrl": "https://gfzoda.tumblr.com/",
      "articles": [
        {
          "id": "https://gfzoda.tumblr.com/post/655545039909437440",
          "author": null,
          "description": "dexterjettsters:\n\nwoke up today and chose violence (loving with my full heart and unable to escape the belief that humans may not be inherently good but are capable of great good and that we weren’t meant to live as we are now)",
          "link": "https://gfzoda.tumblr.com/post/655545039909437440",
          "publishedOn": "2021-07-01T21:54:27.000Z",
          "wordCount": 309,
          "title": "dexterjettsters:woke up today and chose violence (loving with my full heart and unable to escape the..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/655474426604830720",
          "author": null,
          "description": "ariaste:\n\nariaste:\n\nTHE HANDS OF THE EMPEROR by Victoria Goddard!!!! Please read this book, it is my new FAVORITE book, it is the best thing in the entire world and it has literally changed my life. \nIt’s The Goblin Emperor (fealty, ethics, loyalty, the joy of serving a worthy and honorable lord), meets The West Wing (liberal politics, conversations in hallways, the long slow process of making the world better by increments, “Do you have a best friend? Is he smarter than you? Do  you trust him with your life? That’s your chief of staff.”), meets Moana (leaving home to follow the call of a powerful dream, returning home to bring back the dream and the fruits of your labor to your people, community and family, a solo journey across the sea mirrors an internal journey of personal identity).\n\nHere’s the link to buy it on Amazon\nAnd here’s the link to buy the hardback on Bookshop.org (Note: You will see the $42 price tag and wince, but I will point out that it is 900 pages long, which is really like three books, and $42 is not a bad price at all for three books. Just a factor to consider!)\n\nOkay well, this is going VERY well, and we have a discord chat now. Here’s the link: https://discord.gg/NWSDsDMBMk (Link updated 6/29/21)",
          "link": "https://gfzoda.tumblr.com/post/655474426604830720",
          "publishedOn": "2021-07-01T03:12:05.000Z",
          "wordCount": 517,
          "title": "ariaste:ariaste:THE HANDS OF THE EMPEROR by Victoria Goddard!!!!..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/655459431021182976",
          "author": null,
          "description": "passionpeachy:\n\npassionpeachy:\n\nnot to be the 1st person to die in a horror movie but I don’t 100% believe in ghosts and even if they were real I’m much more afraid of capitalism so I’m considering buying a haunted house in the future if that means it’s at a very reduced cost and it’s gonna take way more than doors suddenly closing to change my mind",
          "link": "https://gfzoda.tumblr.com/post/655459431021182976",
          "publishedOn": "2021-06-30T23:13:44.000Z",
          "wordCount": 343,
          "title": "passionpeachy:passionpeachy:not to be the 1st person to die in a horror movie but I don’t 100%..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/655418577596350464",
          "author": null,
          "description": "thisgirlshouldbestudying:\nGood Omens S2 doesn’t need a plot. I just want to see David Tenant and Michael Sheen being chaotic for as long as possible.",
          "link": "https://gfzoda.tumblr.com/post/655418577596350464",
          "publishedOn": "2021-06-30T12:24:23.000Z",
          "wordCount": 267,
          "title": "thisgirlshouldbestudying:\n\nGood Omens S2 doesn’t need a plot. I just want to see David Tenant and..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/655285381836734464",
          "author": null,
          "description": "alsharira:\n\nSomeone described themselves as not in the “supernatural fandom” but in the “supernatural fandom fandom” and I feel so seen.",
          "link": "https://gfzoda.tumblr.com/post/655285381836734464",
          "publishedOn": "2021-06-29T01:07:18.000Z",
          "wordCount": 273,
          "title": "alsharira:Someone described themselves as not in the “supernatural fandom” but in the “supernatural..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/655020328845770752",
          "author": null,
          "description": "kitten-kin:\n\nleahazel:\nkitten-kin:\n\nveliseraptor:\nthat ‘pakige?’ post but me, a couple hours after posting a fic, like ‘comints?’\n\n\n\n\nF5 F5 F5\n\n\n\n… F5 F5 F5 F5F5F5F5F5",
          "link": "https://gfzoda.tumblr.com/post/655020328845770752",
          "publishedOn": "2021-06-26T02:54:24.000Z",
          "wordCount": 268,
          "title": "kitten-kin:leahazel:\n\nkitten-kin:\nveliseraptor:\n\nthat ‘pakige?’ post but me, a couple hours after..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654623564143656960",
          "author": null,
          "description": "phoenixwrites:\n\nplague-chan-vs-the-world:\n\nglumshoe:\n\n“influencer” is such a sinister title. it’s got all the menace of “royal adviser” but none of the raw sex appeal. \n\nwhenever I hear “influencer” I think of this",
          "link": "https://gfzoda.tumblr.com/post/654623564143656960",
          "publishedOn": "2021-06-21T17:48:00.000Z",
          "wordCount": 311,
          "title": "phoenixwrites:plague-chan-vs-the-world:glumshoe:“influencer” is such a sinister title. it’s got all..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654454600026537984",
          "author": null,
          "description": "official-mugi:",
          "link": "https://gfzoda.tumblr.com/post/654454600026537984",
          "publishedOn": "2021-06-19T21:02:23.000Z",
          "wordCount": 239,
          "title": "official-mugi:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654442887291027456",
          "author": null,
          "description": "20-something year old biology/fantasy/podcast geek! they/them. hmu if u wanna talk about worms",
          "link": "https://gfzoda.tumblr.com/post/654442887291027456",
          "publishedOn": "2021-06-19T17:56:13.000Z",
          "wordCount": 257,
          "title": "Photo"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654442884299390976",
          "author": null,
          "description": "20-something year old biology/fantasy/podcast geek! they/them. hmu if u wanna talk about worms",
          "link": "https://gfzoda.tumblr.com/post/654442884299390976",
          "publishedOn": "2021-06-19T17:56:10.000Z",
          "wordCount": 264,
          "title": "Photo"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654422864347447296",
          "author": null,
          "description": "lightbenderlin:\n\nbonecouch:\nthatll-do:\n\nbetchawanna:\n\nThe Hague, Netherlands: Spanish street musician Borja Catanesi and the 68 year old dancer from The Hague mr Roland Parijs\n\nimagine just playing your guitar and you come across the FUNKIEST grandpa \n\n\n\nwizard duel\n\n\n\nwizard collaboration",
          "link": "https://gfzoda.tumblr.com/post/654422864347447296",
          "publishedOn": "2021-06-19T12:37:57.000Z",
          "wordCount": 303,
          "title": "lightbenderlin:bonecouch:\n\nthatll-do:betchawanna:The Hague,..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654422752796803072",
          "author": null,
          "description": "maxkillertart:\n\nmaxkillertart:\nmaxkillertart:\nreminder that\n\n\nA reminder this E3 season 😊\n\n\n\n\nExactly. I want worse graphics, regardless if the style. I don’t want 300,000 polygons. I don’t want the top of the line ray tracing and particle effects that needs an insane amount of crunch and crushes the mental stability of designers and artists.",
          "link": "https://gfzoda.tumblr.com/post/654422752796803072",
          "publishedOn": "2021-06-19T12:36:11.000Z",
          "wordCount": 335,
          "title": "maxkillertart:maxkillertart:\n\nmaxkillertart:\n\nreminder that\n\ni want shorter games with worse..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654332073827516416",
          "author": null,
          "description": "afronerdism:\n\nPrison abolition. Today. Always.",
          "link": "https://gfzoda.tumblr.com/post/654332073827516416",
          "publishedOn": "2021-06-18T12:34:53.000Z",
          "wordCount": 272,
          "title": "afronerdism:Prison abolition. Today. Always."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654256590092992512",
          "author": null,
          "description": "ewil:\n\ndelusional-cannibal:\newil:\n\n\n\nthis is the worst website",
          "link": "https://gfzoda.tumblr.com/post/654256590092992512",
          "publishedOn": "2021-06-17T16:35:06.000Z",
          "wordCount": 273,
          "title": "ewil:delusional-cannibal:\n\newil:\n\nmurder is bad? even if i say sorry afterwards? even if i am an..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654166254196817920",
          "author": null,
          "description": "neotrances:\n\ni like being out of the loop on every video game franchise ever bc u guys are on the dash right now like “PEBBLE NEBBLE FROM SUPER SQUIRT GALAXY JUST GOT ANNOUNCED FOR SMASH WORLD” and it means something i think, not to me, but it means a lot to you and thats whats important",
          "link": "https://gfzoda.tumblr.com/post/654166254196817920",
          "publishedOn": "2021-06-16T16:39:15.000Z",
          "wordCount": 304,
          "title": "neotrances:i like being out of the loop on every video game franchise ever bc u guys are on the dash..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654016118369009665",
          "author": null,
          "description": "fruitz:",
          "link": "https://gfzoda.tumblr.com/post/654016118369009665",
          "publishedOn": "2021-06-15T00:52:54.000Z",
          "wordCount": 248,
          "title": "fruitz:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/654016086334980096",
          "author": null,
          "description": "local-friendlycryptid:\n\nanxietyproblem:\n\n[ID: A screenshot from Facebook from (@kev Thomas) it says “life is a tornado and I’m just a cow being spun around for cinematic value”/END ID]",
          "link": "https://gfzoda.tumblr.com/post/654016086334980096",
          "publishedOn": "2021-06-15T00:52:24.000Z",
          "wordCount": 278,
          "title": "local-friendlycryptid:anxietyproblem:[ID: A screenshot from Facebook from (@kev Thomas) it says..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885489528651776",
          "author": null,
          "description": "catchymemes:",
          "link": "https://gfzoda.tumblr.com/post/653885489528651776",
          "publishedOn": "2021-06-13T14:16:37.000Z",
          "wordCount": 247,
          "title": "Astronaut tweets"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885461923872768",
          "author": null,
          "description": "babyphat05:\n\nMeeting friends is so much harder than people think. Like actually finding a group of people who you can genuinely vibe with and who you can trust is a hard process that can take years on top of years. Making fun of people who may have a harder time meeting friends is whack, it’s really not something that happens overnight.",
          "link": "https://gfzoda.tumblr.com/post/653885461923872768",
          "publishedOn": "2021-06-13T14:16:10.000Z",
          "wordCount": 338,
          "title": "babyphat05:Meeting friends is so much harder than people think. Like actually finding a group of..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653885446226608128",
          "author": null,
          "description": "dwarvishring:\n\nian mckellen directed these movies actually",
          "link": "https://gfzoda.tumblr.com/post/653885446226608128",
          "publishedOn": "2021-06-13T14:15:55.000Z",
          "wordCount": 264,
          "title": "dwarvishring:ian mckellen directed these movies actually"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653809037370114049",
          "author": null,
          "description": "sugary-bowl:\nkropotkindersurprise:\n\nJune 22 2019 - A fascist trying to pick a fight at Bologna Pride gets more reaction than he bargained for. [video]\n\n\nExit, pursued by bear.",
          "link": "https://gfzoda.tumblr.com/post/653809037370114049",
          "publishedOn": "2021-06-12T18:01:26.000Z",
          "wordCount": 283,
          "title": "sugary-bowl:\n\nkropotkindersurprise:June 22 2019 - A fascist..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653793552742187008",
          "author": null,
          "description": "theplantqueer:\n\nsciencevevo:\nthyrell:\nout: gender reveal party\nin: gender repeal party\n\n[ID: Laura Jane Grace grinning and burning her birth certificate live on stage /end ID]",
          "link": "https://gfzoda.tumblr.com/post/653793552742187008",
          "publishedOn": "2021-06-12T13:55:19.000Z",
          "wordCount": 275,
          "title": "theplantqueer:\nsciencevevo:\n\nthyrell:\n\nout: gender reveal party\nin: gender repeal party\n\n\n\n[ID:..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653793217813331968",
          "author": null,
          "description": "zooterscooter:\n\nlistening to will wood and the tapeworms like",
          "link": "https://gfzoda.tumblr.com/post/653793217813331968",
          "publishedOn": "2021-06-12T13:50:00.000Z",
          "wordCount": 262,
          "title": "zooterscooter:listening to will wood and the tapeworms like"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653708816226140160",
          "author": null,
          "description": "cipheramnesia:\n\ncipheramnesia:\n\nI don’t care about hot girl summer, but everyone better fucking be vaccinated by Halloween, feel me? \n\nout of the way hot girl summer \nMonster Fucker Fall is gonna get it",
          "link": "https://gfzoda.tumblr.com/post/653708816226140160",
          "publishedOn": "2021-06-11T15:28:28.000Z",
          "wordCount": 302,
          "title": "cipheramnesia:cipheramnesia:I don&rsquo;t care about hot girl summer, but everyone better fucking be..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653639767004758016",
          "author": null,
          "description": "red-faced-wolf:\n\nkaijuno:\n\nWait this is funny\n\nThis humor is so fucking advanced yet so fucking simple at the same time",
          "link": "https://gfzoda.tumblr.com/post/653639767004758016",
          "publishedOn": "2021-06-10T21:10:57.000Z",
          "wordCount": 279,
          "title": "red-faced-wolf:kaijuno:Wait this is funnyThis humor is so fucking advanced yet so fucking simple at..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653623266934669312",
          "author": null,
          "description": "coldasawitchestit:\n\nSomething that makes me happy. Witches of the Discworld. They make me feel strong",
          "link": "https://gfzoda.tumblr.com/post/653623266934669312",
          "publishedOn": "2021-06-10T16:48:42.000Z",
          "wordCount": 290,
          "title": "coldasawitchestit:Something that makes me happy. Witches of the Discworld. They make me feel strong"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653620928229556224",
          "author": null,
          "description": "phemiec:\n\nReading The Lock Tomb series like:\nHeart wrenchingly beautiful prose-TEN YEAR OLD MEME-descriptive language so visceral and brilliant you feel it through your whole body-HORRIBLE DAD JOKE-a paragraph so original, poignant and resonant it’s like nothing you’ve ever read before, to the point where you’re sure you’re reading the work of a genius, the likes of which have never before- HOMESTUCK REFERENCE. ANOTHER EVEN WORSE DAD JOKE. TWENTY YEAR OLD MEME. FUCK YOUR IMMERSION, GET RICK ROLLED BITCH.",
          "link": "https://gfzoda.tumblr.com/post/653620928229556224",
          "publishedOn": "2021-06-10T16:11:31.000Z",
          "wordCount": 341,
          "title": "phemiec:Reading The Lock Tomb series like:Heart wrenchingly beautiful prose-TEN YEAR OLD..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653603419797504000",
          "author": null,
          "description": "callmebliss-got-swamped:\n\nkaczynskis:\n\nI clicked fearing it would be Out Of Touch but, instead, it is perfectly splendid",
          "link": "https://gfzoda.tumblr.com/post/653603419797504000",
          "publishedOn": "2021-06-10T11:33:14.000Z",
          "wordCount": 263,
          "title": "callmebliss-got-swamped:kaczynskis:I clicked fearing it would be Out Of Touch but, instead, it is..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653469269034729472",
          "author": null,
          "description": "cheeseanonioncrisps:\n\nFact 1: ‘Rubber duck debugging’ is a programming technique whereby a programmer explains their code, line by line, to a rubber duck. The idea is that in explaining it they will eventually figure out what the problem is.\nFact 2: In the same way, a lot of ordinary non-programming problems can be solved by talking them over with a friend, even if said friend does not actually know that much about the topic/situation and can’t contribute much to the conversation.\nFact 3: When you thank said friend for helping you solve your problem, and they reply “I didn’t really say anything”, it is very inadvisable to take the opportunity to tell them about Fact 1. No matter how interesting a comparison it may seem at the time.",
          "link": "https://gfzoda.tumblr.com/post/653469269034729472",
          "publishedOn": "2021-06-09T00:00:58.000Z",
          "wordCount": 375,
          "title": "cheeseanonioncrisps:Fact 1: &lsquo;Rubber duck debugging&rsquo; is a programming technique whereby a..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444588162383872",
          "author": null,
          "description": "nascencio:\n\napplejuicewerewolf:\n\noflightbluecupcakes:\n\nesclapo:\n\nrikusqueenofhearts:\n\nkleeklutch:\n\n\nhappy pride month to country mama lynn and country mama lynn only\n\nSomeone give this woman a damn crown and medal\n\nHappy pride month to country mama lynn and ger gay son only\n\nCountry mama Lynn and her baseball bat could protect pride better than any cop",
          "link": "https://gfzoda.tumblr.com/post/653444588162383872",
          "publishedOn": "2021-06-08T17:28:40.000Z",
          "wordCount": 300,
          "title": "nascencio:applejuicewerewolf:oflightbluecupcakes:esclapo:rikusqueenofhearts:kleeklutch:happy pride..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444410559889408",
          "author": null,
          "description": "raevenlywrites:\n\nraevenlywrites:\n\nYou can read a summary of my gender for free but the full gender is behind a paywall\n\nYou can perceive my gender five times a month for free but if you want to stay up to date on my latest gender you’ll have to subscribe",
          "link": "https://gfzoda.tumblr.com/post/653444410559889408",
          "publishedOn": "2021-06-08T17:25:51.000Z",
          "wordCount": 290,
          "title": "raevenlywrites:raevenlywrites:You can read a summary of my gender for free but the full gender is..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444383553830912",
          "author": null,
          "description": "sharper-and-bigger:\n\nmartianaviator:\n\nysabelmystic:\n\nI just heard my mom tell my brother, “when you die, you will go outside and garden until your father says you’re done” and it took me a second to realize that my brother was playing a videogame and this was not a theological discussion. \n\nPurgatory\n\nThe Garden of Death\nWatercolor and gouache by Hugo Simberg, 1896",
          "link": "https://gfzoda.tumblr.com/post/653444383553830912",
          "publishedOn": "2021-06-08T17:25:25.000Z",
          "wordCount": 320,
          "title": "sharper-and-bigger:martianaviator:ysabelmystic:I just heard my mom tell my brother, “when you die,..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653444299296538624",
          "author": null,
          "description": "clementiens:",
          "link": "https://gfzoda.tumblr.com/post/653444299296538624",
          "publishedOn": "2021-06-08T17:24:05.000Z",
          "wordCount": 245,
          "title": "clementiens:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653353561014566912",
          "author": null,
          "description": "qillermeme:",
          "link": "https://gfzoda.tumblr.com/post/653353561014566912",
          "publishedOn": "2021-06-07T17:21:50.000Z",
          "wordCount": 243,
          "title": "qillermeme:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653250585711263744",
          "author": null,
          "description": "cheese-whiz-barber:\n\nSome pride flags color picked from gastropods",
          "link": "https://gfzoda.tumblr.com/post/653250585711263744",
          "publishedOn": "2021-06-06T14:05:05.000Z",
          "wordCount": 266,
          "title": "cheese-whiz-barber:Some pride flags color picked from gastropods"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653250042755448833",
          "author": null,
          "description": "leonardepsilonchurch:\nCracking open a cold one1 with the boys.\n1: A can of worms.",
          "link": "https://gfzoda.tumblr.com/post/653250042755448833",
          "publishedOn": "2021-06-06T13:56:27.000Z",
          "wordCount": 91,
          "title": "leonardepsilonchurch:\n\nCracking open a cold one1 with the boys.1: A can of worms."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653245585532551168",
          "author": null,
          "description": "mooonbride:\n\nYou’re laughing. This is my second form and the latin choir has started singing, and you’re laughing.",
          "link": "https://gfzoda.tumblr.com/post/653245585532551168",
          "publishedOn": "2021-06-06T12:45:37.000Z",
          "wordCount": 284,
          "title": "mooonbride:You’re laughing. This is my second form and the latin choir has started singing, and..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653244501707685888",
          "author": null,
          "description": "vivienvalentino:\n\n\nspotalike creates a playlist based on a song\nmagicplaylist \n\ncreates a playlist based on a song\n\n\ndubolt \n\ncreates a playlist based on an artist\nboilthefrog creates a playlist between any two artists \npredominant suggests you albums based on cover art color   \nmusic-map \n\nsuggests similar artists\ngnoosic \n\nsuggests similar artists and songs",
          "link": "https://gfzoda.tumblr.com/post/653244501707685888",
          "publishedOn": "2021-06-06T12:28:23.000Z",
          "wordCount": 327,
          "title": "some sites for when you’re bored and looking for new music"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653244062708744192",
          "author": null,
          "description": "adelicateculturecell:\n\n\nJourney to the Microcosmos- Flatworms: Simple Wiggly Tubes\n\nImages Originally Captured by Jam’s Germs\nQuote Voiced by Jam’s Germs",
          "link": "https://gfzoda.tumblr.com/post/653244062708744192",
          "publishedOn": "2021-06-06T12:21:24.000Z",
          "wordCount": 275,
          "title": "adelicateculturecell:\n\n\n\nJourney to the Microcosmos- Flatworms:..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653094095015837696",
          "author": null,
          "description": "avanjogiagf:",
          "link": "https://gfzoda.tumblr.com/post/653094095015837696",
          "publishedOn": "2021-06-04T20:37:44.000Z",
          "wordCount": 247,
          "title": "avanjogiagf:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653073453988085760",
          "author": null,
          "description": "odin-n-out:\n\nodin-n-out:\n\nI feel absolute rage when i call An Office and have to sit through a 5 minute recording telling me I can just use their website thanks!!! I can’t! Believe it or not I’m a child of the internet age who went on your website and it was shit!! Get me a human person!!!!",
          "link": "https://gfzoda.tumblr.com/post/653073453988085760",
          "publishedOn": "2021-06-04T15:09:39.000Z",
          "wordCount": 320,
          "title": "odin-n-out:odin-n-out:I feel absolute rage when i call An Office and have to sit through a 5 minute..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005794301902848",
          "author": null,
          "description": "quixoty:\n\ngutter-guy:\ngutter-guy:\nYou shouldn’t be treating nb people like the secret sexy 3rd gender. Nb people don’t look like a mash of male and female, they’re not sexy androgynous twinks\n\nwhite skinny androgynous nb people reblogging this and saying shit like “Well this is what I look like! So I feel represented!” Are literally part of the problem. I’m not saying that no nb people are white/skinny/andro, I’m saying that those are the only type of nb bodies that get represented \n\n\nits nice, isnt it, when nonbinary people are visibly distinct from binary people? its easy, isnt it? you can remember to use “they” for people who have no visible breasts or beards, right? no need to challenge the notion of male vs female if nonbinary people have their own look, isnt that right?\nits time to step the fuck up and really understand that nonbinary looks like anybody. nonbinary looks like you. nonbinary looks like your family and friends and it looks like the strangers who you thoughtlessly call “he” or “she” because of their appearance.\nreally supporting nonbinary people means understanding that theres no visual tell - you wont recognise all of us as nonbinary on sight. you have to actually LISTEN to us. you have to BELIEVE us. and it means challenging your assumptions about gender, starting with the assumption that youre an ally to trans people while youre still doing puerile shit like gendering body parts and clothes.\nNONBINARY LOOKS LIKE ANYBODY. ANY BODY CAN BE NONBINARY.",
          "link": "https://gfzoda.tumblr.com/post/653005794301902848",
          "publishedOn": "2021-06-03T21:14:14.000Z",
          "wordCount": 522,
          "title": "quixoty:\ngutter-guy:\n\ngutter-guy:\nYou shouldn’t be treating nb people like the secret sexy 3rd..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005764339875840",
          "author": null,
          "description": "serialephemera:\n\nThematically speaking, the most important thing Terry Pratchett taught me was the concept of militant decency. The idea that you can look at the world and its flaws and its injustices and its cruelties and get deeply, intensely angry, and that you can turn that into energy for doing the right thing and making the world a better place. He taught me that the anger itself is not the part I should be fighting. Nobody in my life ever said that before.",
          "link": "https://gfzoda.tumblr.com/post/653005764339875840",
          "publishedOn": "2021-06-03T21:13:45.000Z",
          "wordCount": 329,
          "title": "serialephemera:Thematically speaking, the most important thing Terry Pratchett taught me was the..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005701107662848",
          "author": null,
          "description": "leafdyke:\n\n“humanity is inherently selfish and bad” bbbrrrghuhjfkg. humanity is seeing a stranger’s grocery bag break open on the sidewalk and harvesting fruits and veggies from the branch-like cracks of the asphalt for them, just because you can. humanity is helping a lost child find their mother on a crowded beach, looking for the ladybug-patterned parasol with their hummingbird-small hand in yours. it’s an elder’s fingers wrapped around your arm as you help them up the stairs because the elevator is broken, and feeling like you’re doing exactly what you’re supposed to be doing, like this is what you would’ve been doing had you been alive centuries or even millennia ago. there will always be a heavily pregnant woman who will smile at your when you give up your seat, a nice blind man in the fruit aisle who will ask you to please pick the riper plantain for him, a tired cashier whose face will light up when you compliment their tattoo sleeve. humanity is connection",
          "link": "https://gfzoda.tumblr.com/post/653005701107662848",
          "publishedOn": "2021-06-03T21:12:45.000Z",
          "wordCount": 431,
          "title": "leafdyke:“humanity is inherently selfish and bad” bbbrrrghuhjfkg. humanity is seeing a stranger’s..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/653005504345440256",
          "author": null,
          "description": "monstrousgourmandizingcats:\n\nheadspace-hotel:\n\nheadspace-hotel:\n\nheadspace-hotel:\n\nshoutout to everybody who cannot partake in the shared history spongebob memes give everyone because they were, for some inexplicable reason, never allowed to watch spongebob \n\nIt’s weird because unlike most other experiences, this is not one you can go back and rectify. It’s already too late for me to grow up watching spongebob  \n\nFew things in this world can be genuinely lost forever and I don’t know how to feel that this, of all things, is one of them \n\n\n\nI disliked Spongebob as a kid and decided on my own not to watch it. It kept preempting ATLA.",
          "link": "https://gfzoda.tumblr.com/post/653005504345440256",
          "publishedOn": "2021-06-03T21:09:37.000Z",
          "wordCount": 396,
          "title": "monstrousgourmandizingcats:headspace-hotel:headspace-hotel:headspace-hotel:shoutout to everybody who..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/652917645695418368",
          "author": null,
          "description": "mossworm:\n\nbee time",
          "link": "https://gfzoda.tumblr.com/post/652917645695418368",
          "publishedOn": "2021-06-02T21:53:09.000Z",
          "wordCount": 250,
          "title": "mossworm:bee time"
        }
      ]
    },
    {
      "title": "CuriosityConfusion",
      "feedUrl": "http://curiosityconfusion.tumblr.com/rss",
      "siteUrl": "https://curiosityconfusion.tumblr.com/",
      "articles": [
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655552317539614720",
          "author": null,
          "description": "astrodidact:",
          "link": "https://curiosityconfusion.tumblr.com/post/655552317539614720",
          "publishedOn": "2021-07-01T23:50:08.000Z",
          "wordCount": 234,
          "title": "astrodidact:"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655436317318152192",
          "author": null,
          "description": "parliamentrook:\n\nlifewithoutcosette:\n\nit takes a long time to learn this, I still struggle with it",
          "link": "https://curiosityconfusion.tumblr.com/post/655436317318152192",
          "publishedOn": "2021-06-30T17:06:21.000Z",
          "wordCount": 256,
          "title": "parliamentrook:lifewithoutcosette:it takes a long time to learn this, I still struggle with it"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655426934040330240",
          "author": null,
          "description": "linabeanart:\n\nhere’s your reminder to let yourself create. not create ‘well’, just create. draw badly. write shitty poems. sing stupid songs. make whatever you want & have a great time doing it. that’s what creation is for. it’s self expression, not perfection",
          "link": "https://curiosityconfusion.tumblr.com/post/655426934040330240",
          "publishedOn": "2021-06-30T14:37:13.000Z",
          "wordCount": 276,
          "title": "linabeanart:here’s your reminder to let yourself create. not create ‘well’, just create. draw badly...."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655291017697902592",
          "author": null,
          "description": "hjbender:\n\nolderthannetfic:\n\nolderthannetfic:\n\njemariel:\n\nsparkylurkdragon:\n\nao3commentoftheday:\n\nSomewhere in my notes in the last few days I saw someone add some tags that I’ve been thinking about ever since. I wish I could find them again (or that I’d just saved their post at the time) because I think they made a lot of sense. \nThey were talking about how fanfic is becoming more and more mainstream while still remaining largely transgressive. It’s such an interesting dichotomy to think about!\nOn the one hand, you have sites like AO3 and realities like widespread high speed internet access being more and more accessible to larger and larger groups of people. This makes it incredibly easy for anyone at all to find and read fanfic. \nOn the other hand, you have the roots of fanfic. It was b…",
          "link": "https://curiosityconfusion.tumblr.com/post/655291017697902592",
          "publishedOn": "2021-06-29T02:36:53.000Z",
          "wordCount": 1723,
          "title": "hjbender:olderthannetfic:olderthannetfic:jemariel:sparkylurkdragon:ao3commentoftheday:Somewhere in..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655267694208286720",
          "author": null,
          "description": "thegreenpea:\n\nfr3ight-train:\n\nacutelesbian:\nfat-thin-skinny:\nacutelesbian:\nA lot of people ask me what my biggest fear is, or what scares me most. And I know they expect an answer like heights, or closed spaces, or people dressed like animals, but how do I tell them that when I was 17 I took a class called Relationships For Life and I learned that most people fall out of love for the same reasons they fell in it. That their lover’s once endearing stubbornness has now become refusal to compromise and their one track mind is now immaturity and their bad habits that you once adored is now money down the drain. Their spontaneity becomes reckless and irresponsible and their feet up on your dash is no longer sexy, just another distraction in your busy life. \nthis fucks me up every single time\nI …",
          "link": "https://curiosityconfusion.tumblr.com/post/655267694208286720",
          "publishedOn": "2021-06-28T20:26:10.000Z",
          "wordCount": 751,
          "title": "thegreenpea:fr3ight-train:\nacutelesbian:\n\nfat-thin-skinny:\n\nacutelesbian:\n\nA lot of people ask me..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655252852756873216",
          "author": null,
          "description": "douceurs:\nexcerpt from “The Book of Delights” by Ross Gay (transcript under the cut) \n Keep reading",
          "link": "https://curiosityconfusion.tumblr.com/post/655252852756873216",
          "publishedOn": "2021-06-28T16:30:16.000Z",
          "wordCount": 257,
          "title": "douceurs:\n\nexcerpt from “The Book of Delights” by Ross Gay..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655192504968282112",
          "author": null,
          "description": "eldritchgentleman:\n\njarhead4life:\n\nI swear this looks like a painting.",
          "link": "https://curiosityconfusion.tumblr.com/post/655192504968282112",
          "publishedOn": "2021-06-28T00:31:04.000Z",
          "wordCount": 248,
          "title": "eldritchgentleman:jarhead4life:I swear this looks like a painting."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655105831503855616",
          "author": null,
          "description": "tturing:\n\nalright i did it\ni guess your taste in men without being a complete asshole (NSFW)",
          "link": "https://curiosityconfusion.tumblr.com/post/655105831503855616",
          "publishedOn": "2021-06-27T01:33:26.000Z",
          "wordCount": 298,
          "title": "tturing:\nalright i did iti guess your taste in men without being a complete asshole (NSFW)"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655097491916783617",
          "author": null,
          "description": "such-justice-wow:\n\nmathsturbation:\ni am the shyest attention whore ever\nI want attention!!! If you’re not busy… And you want to…. Its okay if you don’t",
          "link": "https://curiosityconfusion.tumblr.com/post/655097491916783617",
          "publishedOn": "2021-06-26T23:20:52.000Z",
          "wordCount": 290,
          "title": "such-justice-wow:mathsturbation:\n\ni am the shyest attention whore ever\n\n\nI want attention!!! If..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655092024149704706",
          "author": null,
          "description": "tristaniseult:\n\nfinnlesbian:\n\nwall-e watching the couple in hello, dolly! hold hands as they walk and the camera pans to its wide eyes, brightened by the television reflection. then wall-e opens its claws little by little to fit together, holding its own hand, the last living thing on earth. alone with no one else but itself. and wall-e looks back up at the screen to see if its doing it right. the scene is so heart wrenching i can literally feel the sobs i was suppressing at 11, fighting their way back up my throat right now.\n\n\nthe touch - anne sexton",
          "link": "https://curiosityconfusion.tumblr.com/post/655092024149704706",
          "publishedOn": "2021-06-26T21:53:58.000Z",
          "wordCount": 326,
          "title": "tristaniseult:finnlesbian:wall-e watching the couple in hello, dolly! hold hands as they walk and..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655022872806506496",
          "author": null,
          "description": "serialkilersx:\n\nI love affection and reassurance, in fact I’d like to be drowned in it",
          "link": "https://curiosityconfusion.tumblr.com/post/655022872806506496",
          "publishedOn": "2021-06-26T03:34:50.000Z",
          "wordCount": 253,
          "title": "serialkilersx:I love affection and reassurance, in fact I’d like to be drowned in it"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/655016550519144448",
          "author": null,
          "description": "halflifethree:\n\nreblog this post to give the person you rbed from a bowl of soup and a piece of bread :)",
          "link": "https://curiosityconfusion.tumblr.com/post/655016550519144448",
          "publishedOn": "2021-06-26T01:54:21.000Z",
          "wordCount": 275,
          "title": "halflifethree:reblog this post to give the person you rbed from a bowl of soup and a piece of bread..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654921986076786688",
          "author": null,
          "description": "smoooothbrain:\n\ndo you ever think about how if you dive into the ocean and go deeper and deeper you will pass through layers of darker and darker blue until everything is black and cold and the pressure will be so intense that it will kill you without protection but if you keep going you will find little glowing specks of light, and if you go up into the sky and go higher and higher you will pass through layers of darker and darker blue until everything is black and cold and the pressure will be so intense that it will kill you without protection but if you keep going you will find little glowing specks of light",
          "link": "https://curiosityconfusion.tumblr.com/post/654921986076786688",
          "publishedOn": "2021-06-25T00:51:17.000Z",
          "wordCount": 354,
          "title": "smoooothbrain:do you ever think about how if you dive into the ocean and go deeper and deeper you..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654916743188430848",
          "author": null,
          "description": "moveslikekeithrichards:\nmoveslikekeithrichards:\n\nmoveslikekeithrichards:\n\ni think everything should come in more fun colors & patterns. like everything. houses. cars. appliances. when ur getting a fridge they should give u the option then & there to have a wizard airbrushed onto it. business attire should have dinosaurs on it. why arent there more pink cars\n\nevery once in a blue moon i see this bright pink car with a massive tinkerbell decal on the hood & i think that person just Gets It. why cant that be the norm\n\nnormalize fun",
          "link": "https://curiosityconfusion.tumblr.com/post/654916743188430848",
          "publishedOn": "2021-06-24T23:27:57.000Z",
          "wordCount": 323,
          "title": "moveslikekeithrichards:\n\nmoveslikekeithrichards:moveslikekeithrichards:i think everything should..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654840228958339072",
          "author": null,
          "description": "jb612:\n\nQuote from Welcome to Night Vale",
          "link": "https://curiosityconfusion.tumblr.com/post/654840228958339072",
          "publishedOn": "2021-06-24T03:11:47.000Z",
          "wordCount": 240,
          "title": "jb612:Quote from Welcome to Night Vale"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654835438514782208",
          "author": null,
          "description": "haymitch:\n\nSSI Restoration Act of 2021\ni have never made a post like this before but i haven’t seen anyone here talk about it yet so i want to at least provide some links because this is extremely important for disabled people with or without benefits in the USA.\n\nlink to this tiktok \n\n\nshe doesn’t name the bill in the video but in the comments it’s clarified that the act referred to is the SSI Restoration Act of 2021.\n“The Supplementary Security Income (SSI) Restoration Act of 2021 has been introduced in both the House and the Senate. The bill would improve the lives of millions of SSI beneficiaries around the country, including over 2 million older adults who are living below the federal poverty level due to inadequate benefit levels, and often lose or are denied benefits due to outdated…",
          "link": "https://curiosityconfusion.tumblr.com/post/654835438514782208",
          "publishedOn": "2021-06-24T01:55:39.000Z",
          "wordCount": 879,
          "title": "haymitch:SSI Restoration Act of 2021i have never made a post like this before but i haven’t seen..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654709827467083776",
          "author": null,
          "description": "Dax, they/them, genderqueer, 27",
          "link": "https://curiosityconfusion.tumblr.com/post/654709827467083776",
          "publishedOn": "2021-06-22T16:39:07.000Z",
          "wordCount": 236,
          "title": "Photo"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654573161253355520",
          "author": null,
          "description": "fruitytran:",
          "link": "https://curiosityconfusion.tumblr.com/post/654573161253355520",
          "publishedOn": "2021-06-21T04:26:52.000Z",
          "wordCount": 232,
          "title": "fruitytran:"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654572956631072768",
          "author": null,
          "description": "Dax, they/them, genderqueer, 27",
          "link": "https://curiosityconfusion.tumblr.com/post/654572956631072768",
          "publishedOn": "2021-06-21T04:23:36.000Z",
          "wordCount": 235,
          "title": "Photo"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654460764880535552",
          "author": null,
          "description": "spider-shoes:\n\nmutuals. c'mere. this is a checkpoint. i am checking in. i am wrapping you in a blanket and giving you a nice warm drink. also some pretty flowers. it will be ok.",
          "link": "https://curiosityconfusion.tumblr.com/post/654460764880535552",
          "publishedOn": "2021-06-19T22:40:22.000Z",
          "wordCount": 270,
          "title": "spider-shoes:mutuals. c'mere. this is a checkpoint. i am checking in. i am wrapping you in a blanket..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654447676762488832",
          "author": null,
          "description": "headspace-hotel:\n\nme then (young, naive): i dont swear because there are better choices to make with my vocabulary \nme now (older, wiser): I am master of all the words, and fuck is the best one",
          "link": "https://curiosityconfusion.tumblr.com/post/654447676762488832",
          "publishedOn": "2021-06-19T19:12:20.000Z",
          "wordCount": 264,
          "title": "headspace-hotel:me then (young, naive): i dont swear because there are better choices to make with..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654384473895518208",
          "author": null,
          "description": "hard-times-paramore:\n\nBeing asexual is good, actually. Talking about being asexual is cool and good. Aces can have fun with their sexuality and pride too. Ace pride is a good thing.",
          "link": "https://curiosityconfusion.tumblr.com/post/654384473895518208",
          "publishedOn": "2021-06-19T02:27:45.000Z",
          "wordCount": 277,
          "title": "hard-times-paramore:Being asexual is good, actually. Talking about being asexual is cool and good...."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654384219526660096",
          "author": null,
          "description": "youngchronicpain:\n\nThere is no age limit on chronic pain. Just because you do not like to think about children being in pain does not mean they do not exist. They deserve to be believed and they deserve access to pain management.",
          "link": "https://curiosityconfusion.tumblr.com/post/654384219526660096",
          "publishedOn": "2021-06-19T02:23:43.000Z",
          "wordCount": 361,
          "title": "youngchronicpain:There is no age limit on chronic pain. Just because you do not like to think about..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654377587852902400",
          "author": null,
          "description": "capfalcon:\n\nhonestly that “it costs 0 dollars to be kind” bullshit is bullshit. it does cost things to be kind. it costs time. it costs energy. and it isn’t always easy and it isn’t always natural. it costs so much to be kind, sometimes. but that’s the whole point. if being kind were easy, or simple, every single person would be an angel. but they’re not, and the world isn’t easy and simple. so no, it does cost something to be kind. but it’s worth it anyway.",
          "link": "https://curiosityconfusion.tumblr.com/post/654377587852902400",
          "publishedOn": "2021-06-19T00:38:18.000Z",
          "wordCount": 321,
          "title": "capfalcon:honestly that &ldquo;it costs 0 dollars to be kind&rdquo; bullshit is bullshit. it does..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654367831280009216",
          "author": null,
          "description": "stardustnarcissus:\n\nbisexuality is when u are attracted to both vampires and werewolves",
          "link": "https://curiosityconfusion.tumblr.com/post/654367831280009216",
          "publishedOn": "2021-06-18T22:03:14.000Z",
          "wordCount": 242,
          "title": "stardustnarcissus:bisexuality is when u are attracted to both vampires and werewolves"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/654030174749360128",
          "author": null,
          "description": "murielswedding:\n\nthe thing about self love is you are already doing everything in your day to day to allow yourself to love yourself. if someone else charged your phone, you would appreciate that gesture. if someone else bought or cooked you a meal, you would appreciate that gesture. if someone else did your laundry, you would appreciate that gesture. all of those things are already acts of love to yourself. you don’t have to do anything more to be able to love yourself, you just have to reframe how you think about what you are already doing.",
          "link": "https://curiosityconfusion.tumblr.com/post/654030174749360128",
          "publishedOn": "2021-06-15T04:36:19.000Z",
          "wordCount": 329,
          "title": "murielswedding:the thing about self love is you are already doing everything in your day to day to..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653947950324695040",
          "author": null,
          "description": "tristaniseult:\n\ntristaniseult:\n\nlove looks like the mosaic from ancient rome about a race horse that says: “win or lose, we love you, polidoxus”\n\nlove looks like all the people across history who have cared for their pets and named them sweet things like much-beloved or lovely or precious or grain-of-gold. and commissioned for their likenesses to be carved or painted or made into mosaics. bc their affection was so much greater and grander than the constraints of a human lifetime. and some piece of those pets outlasted even their owners in the annals of history. like that’s love",
          "link": "https://curiosityconfusion.tumblr.com/post/653947950324695040",
          "publishedOn": "2021-06-14T06:49:24.000Z",
          "wordCount": 340,
          "title": "tristaniseult:tristaniseult:love looks like the mosaic from ancient rome about a race horse that..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653830860795248640",
          "author": null,
          "description": "elymaiis:\n\n“If you give a man a fish, he will eat for a day; if you teach a man to fish, he will eat for a lifetime,” but you have done neither. You have stood before us and eaten fish after fish, and chided us for our greed as you have done so. You have cast aside their offal and simultaneously chided us for our waste. You then told us that, coincidentally, you owned the river, and our parents should have gotten us the same if we wanted fish. You gave a man a fish to murder us if we step too close to the river, or speak too loud, or eat a fish from another river. You’ve copyrighted the fishing net. It costs us fish to leave.",
          "link": "https://curiosityconfusion.tumblr.com/post/653830860795248640",
          "publishedOn": "2021-06-12T23:48:19.000Z",
          "wordCount": 388,
          "title": "elymaiis:“If you give a man a fish, he will eat for a day; if you teach a man to fish, he will eat..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653753735325106176",
          "author": null,
          "description": "affectionatesuggestion:\nlet’s go get slurpies together and then go to a park and I’ll push you on the tire swing and we will laugh and laugh until our sides hurt",
          "link": "https://curiosityconfusion.tumblr.com/post/653753735325106176",
          "publishedOn": "2021-06-12T03:22:26.000Z",
          "wordCount": 269,
          "title": "affectionatesuggestion:\n\nlet’s go get slurpies together and then go to a park and I’ll push you on..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653730656964182016",
          "author": null,
          "description": "Has anyone else been getting this ad?? It’s like the only one I see, and I…honestly can’t figure out how to interpret it as anything but advocating for emotional abuse? What does it mean, if not “tired of yelling? Ignore your child until they feel like you don’t care about them!”\n???",
          "link": "https://curiosityconfusion.tumblr.com/post/653730656964182016",
          "publishedOn": "2021-06-11T21:15:37.000Z",
          "wordCount": 119,
          "title": "Has anyone else been getting this ad?? It&rsquo;s like the only one I see, and I&hellip;honestly..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653476111759589376",
          "author": null,
          "description": "birlinterrupted:\ni dont know why people are like ‘we need to bully people so they are more normal’ when if the internet has been anything its been a series of longitudinal studies showing that prolonged large scale bullying tends to lead people to becoming increasingly weird, paranoid, sometimes off-putting, traumatized, emotionally troubled, ethically disregulated, etc. even unethical modalities like behaviorism don’t focus exclusively or primarily on punishment. like people should literally just be honest and say they want more bullying because they like to do it and have fun hurting other people",
          "link": "https://curiosityconfusion.tumblr.com/post/653476111759589376",
          "publishedOn": "2021-06-09T01:49:44.000Z",
          "wordCount": 314,
          "title": "birlinterrupted:\n\ni dont know why people are like ‘we need to bully people so they are more normal’..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653457452285689856",
          "author": null,
          "description": "liv-abetic:\n\nI love that the two universal diabetic inside jokes that almost anyone with diabetes will understand, but must also seem weird to outsiders, are:\n1. Nobody changes their lancets\n2. The Insulin Compartment™️",
          "link": "https://curiosityconfusion.tumblr.com/post/653457452285689856",
          "publishedOn": "2021-06-08T20:53:09.000Z",
          "wordCount": 365,
          "title": "liv-abetic:I love that the two universal diabetic inside jokes that almost anyone with diabetes will..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653392546996830208",
          "author": null,
          "description": "cryptonature:\n\nVultures are holy creatures.\nTending the dead.\nBowing low.\nBared head.\nWhispers to cold flesh,\n“Your old name is not your king.\nI rename you ‘Everything.’”",
          "link": "https://curiosityconfusion.tumblr.com/post/653392546996830208",
          "publishedOn": "2021-06-08T03:41:30.000Z",
          "wordCount": 261,
          "title": "cryptonature:Vultures are holy creatures.Tending the dead.Bowing low.Bared head.Whispers to cold..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653300158218534912",
          "author": null,
          "description": "tr4shie:",
          "link": "https://curiosityconfusion.tumblr.com/post/653300158218534912",
          "publishedOn": "2021-06-07T03:13:01.000Z",
          "wordCount": 242,
          "title": "tr4shie:"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653295505451991040",
          "author": null,
          "description": "spotlessmy-deactivated20210523:\n\nthis was a great read. “Laziness Does Not Exist” by Devon Price",
          "link": "https://curiosityconfusion.tumblr.com/post/653295505451991040",
          "publishedOn": "2021-06-07T01:59:04.000Z",
          "wordCount": 248,
          "title": "spotlessmy-deactivated20210523:this was a great read. “Laziness Does Not Exist” by Devon Price"
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/653285154538831872",
          "author": null,
          "description": "sw-maddie:\n\nsw-maddie:\n\nthe pristine gay/trans experience of communicating to another queer person that you are also queer by specifically complimenting the queer-coded thing about their style\n\nand conversely, being complimented by another queer person on the specifically queer-coded thing about your own style",
          "link": "https://curiosityconfusion.tumblr.com/post/653285154538831872",
          "publishedOn": "2021-06-06T23:14:33.000Z",
          "wordCount": 285,
          "title": "sw-maddie:sw-maddie:the pristine gay/trans experience of communicating to another queer person that..."
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}