{
  "sources": [
    {
      "title": "Dwarf Fortress Development Log",
      "feedUrl": "http://www.bay12games.com/dwarves/dev_now.rss",
      "siteUrl": "http://www.bay12games.com/dwarves/index.html",
      "articles": [
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-05-17",
          "author": null,
          "description": "(Toady One) The second Covid shot.  Which is good, because that should convey a healthy chunk of anti-Covidness.  But it has also knocked me out for days, and I've still got insomnia and I physically tire quickly.  Hopefully that'll all pass before too long.  Still moving this month, and it's going to keep slowing everything down to a crawl.  The lease on the old place lapses this month, so we'll get through it one way or another!  \r\n\t\r\n\t\tHere's the Steam news from earlier, with the excellent trade depots a…",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-05-17",
          "publishedOn": "2021-05-17T19:17:00.000Z",
          "wordCount": 13412,
          "title": "05/17/2021"
        },
        {
          "id": "http://www.bay12games.com/dwarves/index.html#2021-05-01",
          "author": null,
          "description": "(Toady One) And here's \r\n\t\r\n\t\ta report.\r\n\t\r\n  Also \r\n\t\r\n\t\ta future of the fortress reply.",
          "link": "http://www.bay12games.com/dwarves/index.html#2021-05-01",
          "publishedOn": "2021-05-01T19:01:00.000Z",
          "wordCount": 13257,
          "title": "05/01/2021"
        }
      ]
    },
    {
      "title": "fite me",
      "feedUrl": "https://pseudoartist.tumblr.com/rss",
      "siteUrl": "https://pseudoartist.tumblr.com/",
      "articles": []
    },
    {
      "title": "One Thing Well",
      "feedUrl": "http://onethingwell.org/rss",
      "siteUrl": "https://onethingwell.org/",
      "articles": []
    },
    {
      "title": "jwz",
      "feedUrl": "http://www.jwz.org/blog/feed/",
      "siteUrl": "https://www.jwz.org/blog/",
      "articles": [
        {
          "id": "https://jwz.org/b/yjn1",
          "author": "jwz",
          "description": "Not a place of honor.",
          "link": "https://www.jwz.org/blog/2021/05/not-a-place-of-honor/",
          "publishedOn": "2021-05-17T18:25:14.000Z",
          "wordCount": 573,
          "title": "Not a place of honor."
        },
        {
          "id": "https://jwz.org/b/yjn0",
          "author": "jwz",
          "description": "Ladies and Gentlemen, DNA Lounge will be open for your indoors, in-person festivities on Saturday, June 19th! Our lineup that evening begins with Hubba Hubba Revue at 7pm, the full, seated Big Show; then at 10pm, we bring you the triumphant return of Bootie Mashup! And in Above DNA, Xile Collective presents Lower Underground! Obviously the Feds or the State might pull the rug out from under us on this, but our understanding as of today is that in mid June, all restrictions will be lifted in California, and …",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/15.html",
          "publishedOn": "2021-05-15T20:28:49.000Z",
          "wordCount": 341,
          "title": "DNA Lounge: Wherein we are re-opening!"
        },
        {
          "id": "https://jwz.org/b/yjnz",
          "author": "jwz",
          "description": "Please enjoy jwz mixtape 227. I dunno what happened last month -- my faucet of new music videos seems to have slowed to a trickle for a while there. But, it's back now.",
          "link": "https://www.jwz.org/blog/2021/05/jwz-mixtape-227/",
          "publishedOn": "2021-05-14T16:38:46.000Z",
          "wordCount": 540,
          "title": "jwz mixtape 227"
        },
        {
          "id": "https://jwz.org/b/yjny",
          "author": "jwz",
          "description": "Animated map projections",
          "link": "https://www.jwz.org/blog/2021/05/animated-map-projections/",
          "publishedOn": "2021-05-12T20:55:20.000Z",
          "wordCount": 559,
          "title": "Animated map projections"
        },
        {
          "id": "https://jwz.org/b/yjnx",
          "author": "jwz",
          "description": "Wacky 90s fads!",
          "link": "https://www.jwz.org/blog/2021/05/wacky-90s-fads/",
          "publishedOn": "2021-05-12T20:42:18.000Z",
          "wordCount": 544,
          "title": "Wacky 90s fads!"
        },
        {
          "id": "https://jwz.org/b/yjnw",
          "author": "jwz",
          "description": "Jeff Bezos' superyacht is so big it needs its own yacht. The world's richest man is buying a boat, though that word feels inappropriately sensible for the monstrosity going to Captain Bezos: a 417-foot superyacht that's so massive it has its own \"support yacht\" with a helipad. The estimated cost, not including the boat's support boat, is $500 million. Half a billion bucks is an inconceivable amount of money for most people, but it's a small fraction of the $75 billion that Bezos gained in 2020 alone. His to…",
          "link": "https://www.jwz.org/blog/2021/05/today-in-hot-superyacht-probs-7/",
          "publishedOn": "2021-05-11T19:40:20.000Z",
          "wordCount": 813,
          "title": "Today in Hot Superyacht Probs"
        },
        {
          "id": "https://jwz.org/b/yjnt",
          "author": "jwz",
          "description": "I made a time-lapse video of the dance floor installation! This is the first two days of the floor installation. They also came back for a third full day of sanding, but that wasn't very interesting to watch; and now we're going to paint it, which will take another day or two. (We do have an older video where you can watch paint dry, if you're in to that sort of thing.) We set up a laptop recording 24/7 all weekend with OBS, and that generated a 98 GB TS file. Fun fact: guess what Quicktime Player, VLC and …",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/11.html",
          "publishedOn": "2021-05-11T16:18:13.000Z",
          "wordCount": 770,
          "title": "DNA Lounge: Wherein there has been a lapse of time"
        },
        {
          "id": "https://jwz.org/b/yjns",
          "author": "jwz",
          "description": "Thanks to three generous donors who prefer to remain anonymous, we have a new dance floor! And it looks fantastic. The existing floor was a festive pancake of concrete, then a quarter inch of neoprene for springiness, then two layers of plywood. After two decades of dancing, the old plywood was extremly torn up, meaning the surface was rough and splotchy and paint would no longer stick to it well. It was a finished surface but a soft wood, probably pine or Douglas fir. After repairing some soft spots in the…",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/09.html",
          "publishedOn": "2021-05-10T03:36:05.000Z",
          "wordCount": 654,
          "title": "DNA Lounge: Wherein we have a new dance floor!"
        },
        {
          "id": "https://jwz.org/b/yjnp",
          "author": "jwz",
          "description": "We finally got our fan controllers replaced. And there was much rejoicing. We have two gigantic fans on the roof, and about a decade ago the controllers that let us operate them at variable speed broke. Those controllers were many thousands of dollars each, so we just tore them out and replaced them with a pair of on-off switches, meaning the fans were either on at 100%, or off. This kind of sucked (see what I did there). Well it turns out, the price of the controllers has dropped a lot since then, so we fi…",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/08.html",
          "publishedOn": "2021-05-08T17:49:58.000Z",
          "wordCount": 1393,
          "title": "DNA Lounge: Wherein we break a mighty wind."
        },
        {
          "id": "https://jwz.org/b/yjno",
          "author": "jwz",
          "description": "\"Son, what's your dirt doing in Boss's hole?\" Sometimes we get soft spots in the floor, typically where liquids pool and can't evaporate. The floor underneath the photo booth got particularly destroyed, after only a couple of years of the booth sitting there. And the floor under the ATM was also pretty bad. When that happens, sometimes we can just use this stuff called \"Rot Stop\" which is a two part epoxy that is runny enough to penetrate pretty deeply into the wood and makes mushy, soft wood as hard as a r…",
          "link": "https://www.dnalounge.com/backstage/log/2021/05/04.html",
          "publishedOn": "2021-05-04T16:45:28.000Z",
          "wordCount": 446,
          "title": "DNA Lounge: Wherein we pour some floor"
        },
        {
          "id": "https://jwz.org/b/yjnn",
          "author": "jwz",
          "description": "We had to replace our big CO2 tank. It had a slow leak, which was costing us money, and so we had been using smaller rental tanks instead of the big one for quite a while, which was also costing us more money. And Airgas had been pretty unreliable about those deliveries; it seems that the schedule that they are comfortable with is, \"we'll probably fill up the big tank from the street on our own schedule sometime within a six week window\". Anything other than that, and they could hardly be bothered. We often…",
          "link": "https://www.dnalounge.com/backstage/log/2021/04/30.html",
          "publishedOn": "2021-05-01T05:34:43.000Z",
          "wordCount": 748,
          "title": "DNA Lounge: Wherein we've got gas."
        },
        {
          "id": "https://jwz.org/b/yjnl",
          "author": "jwz",
          "description": "\"Burning Man would like to thank you for your generous donation of $2,500 to reserve the right to buy a ticket to an event that is not happening this year.\" Burning Man's ticket sales have always been both rapacious and stultifyingly, comically incompetent, but I see that this year they have finally learned a few things and gone full TicketMaster. Slow clap.",
          "link": "https://www.jwz.org/blog/2021/04/lol-burners/",
          "publishedOn": "2021-04-27T20:00:39.000Z",
          "wordCount": 1842,
          "title": "LOL Burners."
        },
        {
          "id": "https://jwz.org/b/yjni",
          "author": "jwz",
          "description": "So, you just wanna stream 24/7, and occasionally switch input on a timer? How hard could that be? For your amusement, read the comments in the ~2000 line sh script that keeps DNA Lounge running. Here be monsters. When I say that almost all of my coding stems from either self defense or spite, this is what I mean.",
          "link": "https://www.jwz.org/blog/2021/04/look-upon-my-obs-hell-and-despair/",
          "publishedOn": "2021-04-26T17:35:21.000Z",
          "wordCount": 1887,
          "title": "Look upon my OBS hell and despair"
        },
        {
          "id": "https://jwz.org/b/yjnf",
          "author": "jwz",
          "description": "Surprisingly, Apple AirTag has built-in anti-stalking tech: Unfortunately like the discreet Tile product they're modeled on, AirTags sound like a gift from Apple to stalkers and people who'd use them to track the location and movements of unsuspecting victims. For the one in four U.S. women experiencing domestic violence the chime of a found AirTag would be the sound of a nightmare becoming reality. [...] Essentially, an item in iPhone's Safety Alerts section will let you know when a creep slips an AirTag i…",
          "link": "https://www.jwz.org/blog/2021/04/today-in-mark-of-the-beast-news/",
          "publishedOn": "2021-04-24T19:14:35.000Z",
          "wordCount": 1331,
          "title": "Today in Mark of the Beast news:"
        },
        {
          "id": "https://jwz.org/b/yjne",
          "author": "jwz",
          "description": "CBP Releases Video From Predator Drone Deployed Over George Floyd Protests: Shortly after the Minneapolis police killing [ murder -- fixed that for you ] of George Floyd last year, Customs and Border Protection (CBP) flew a Predator drone over the city in an effort to surveil the ongoing protests against police brutality occurring there. The drone, which took off from Grand Forks Air Force Base in North Dakota and flew in a holding pattern over protests for approximately 90 minutes, recorded video from a he…",
          "link": "https://www.jwz.org/blog/2021/04/predator-drone-ambience/",
          "publishedOn": "2021-04-23T21:01:50.000Z",
          "wordCount": 1071,
          "title": "Predator Drone Ambience"
        },
        {
          "id": "https://jwz.org/b/yjnd",
          "author": "jwz",
          "description": "Dear Lazyweb, is there a way of determining whether Apple Pay and Google Pay are actually in use? As opposed to, \"it is theoretically possible for the user to sign up for this service.\" I would like my checkout page to default to them if the customer actualy uses them, but not otherwise. Defaulting to an Apple/Google Pay button when it's not set up is a dark pattern that they are using to try and enlist me into advertising their service to non-users. Apple Pay: This snippet gives a \"yes\" response if you are…",
          "link": "https://www.jwz.org/blog/2021/04/apple-pay-and-google-pay/",
          "publishedOn": "2021-04-23T17:49:15.000Z",
          "wordCount": 1390,
          "title": "Apple Pay and Google Pay"
        },
        {
          "id": "https://jwz.org/b/yjnc",
          "author": "jwz",
          "description": "Ingrid Burrington: I've lately been trying an exercise where, when reading anything by or about tech companies, I replace uses of the word \"infrastructure\" with \"means of production.\" For example, from Facebook's engineering web page: \"Our data centers are the cornerstones of the global means of production that brings Facebook apps and services to you every day.\" The sentence pretty much still makes sense -- without data centers, Facebook can't reach people, and therefore can't make money. It also works pre…",
          "link": "https://www.jwz.org/blog/2021/04/means-of-production/",
          "publishedOn": "2021-04-23T16:00:28.000Z",
          "wordCount": 965,
          "title": "Means of Production"
        },
        {
          "id": "https://jwz.org/b/yjnb",
          "author": "jwz",
          "description": "Governor Newsom says that on June 15th California will be doing The Full Florida. Obviously a lot can happen in 54 days, and for all we know the whole state might shut down again instead, but since there's a chance that we're going to be allowed to operate at a normal capacity by mid-June, we have to start making plans... and by plans I mean \"spending money\". As such, we're looking for a Bar Manager! Is that you? Here's our job posting. Bar Manager Job Description: The historic DNA Lounge is currently seeki…",
          "link": "https://www.dnalounge.com/backstage/log/2021/04/22.html",
          "publishedOn": "2021-04-22T17:15:21.000Z",
          "wordCount": 746,
          "title": "DNA Lounge: Wherein we're... hiring?"
        },
        {
          "id": "https://jwz.org/b/yjna",
          "author": "jwz",
          "description": "I just hope they stop cutting away more and more of my tree. Come on guys, the birds are the only thing I have left.",
          "link": "https://www.jwz.org/blog/2021/04/soma-nature-walk-bandit-intimidator-15xp/",
          "publishedOn": "2021-04-22T16:04:06.000Z",
          "wordCount": 789,
          "title": "SOMA Nature Walk: Bandit Intimidator 15XP"
        },
        {
          "id": "https://jwz.org/b/yjnY",
          "author": "jwz",
          "description": "An immense coal mine in Xinjiang flooded and shut down over the weekend of April 17-18. The blackout halted no less than one-third of all of Bitcoin's global computing power. The Xinjiang accident highlights that Bitcoin is a creature of fossil fuels -- principally coal, the dirtiest of them all. Overall, de Vries reckons that fossil fuels power around 70% of all Bitcoin mines worldwide, and that coal provides the vast majority of that share. \"We now know for sure that one-third of all production runs on pu…",
          "link": "https://www.jwz.org/blog/2021/04/coal-mining-bitcoin-mining-same-thing/",
          "publishedOn": "2021-04-21T23:23:44.000Z",
          "wordCount": 891,
          "title": "Coal mining. Bitcoin mining. Same thing."
        },
        {
          "id": "https://jwz.org/b/yjnX",
          "author": "jwz",
          "description": "It used to be that dragging from the URL bar of one window to a textarea in another would do the only sane thing: paste the URL as text. Now it opens a Finder window displaying a folder called \"WebKitDropDestination-8FCUXgO8\" with a .webloc file in it. Convenient. This started a couple of months ago. Is there some way I can make it stop doing this? Dragging from an HREF still works properly, it seems to be only the URL bar that has developed this new craziness. Generally, I'm impressed with how poorly macOS…",
          "link": "https://www.jwz.org/blog/2021/04/stupid-safari/",
          "publishedOn": "2021-04-21T22:53:36.000Z",
          "wordCount": 1146,
          "title": "Stupid Safari"
        },
        {
          "id": "https://jwz.org/b/yjnW",
          "author": "jwz",
          "description": "This is glorious. I once had a jar of ferrofluid in Lavaite form-factor, but it was difficult to get it to do anything interesting, and completely static without hands-on.",
          "link": "https://www.jwz.org/blog/2021/04/ferrofluid-speaker/",
          "publishedOn": "2021-04-21T22:50:34.000Z",
          "wordCount": 573,
          "title": "Ferrofluid Speaker"
        },
        {
          "id": "https://jwz.org/b/yjnV",
          "author": "jwz",
          "description": "AMNH: &#x1F40B; We've received many questions about the blue whale's bandage: It's real. It was installed yesterday by Trenton from the Exhibition department! It's 6 feet long &#38; 2 feet wide. Come see it for yourself! Register for a vaccine today. (The whale room is a vaccination site, in case you missed that part.)",
          "link": "https://www.jwz.org/blog/2021/04/blue-whale-bandage/",
          "publishedOn": "2021-04-21T15:17:43.000Z",
          "wordCount": 658,
          "title": "Blue Whale Bandage"
        }
      ]
    },
    {
      "title": "Trivium",
      "feedUrl": "http://chneukirchen.org/trivium/index.atom",
      "siteUrl": "https://leahneukirchen.org/trivium/",
      "articles": [
        {
          "id": "https://leahneukirchen.org/trivium/2021-05-09",
          "author": null,
          "description": "21Nails: Multiple vulnerabilities in Exim, a Qualys Security Advisory.\nProving 50-Year-Old Sorting Networks Optimal: Part 1,\nby Jannis Harder.\nWhy I&#8217;ll never create modules for VCV Rack anymore&#8212;and what I&#8217;ll make instead, by Aria Salvatrice.\nContractibility as uniqueness (YouTube), talk by Emily Riehl\nat the Topos Institute.\nObjective-S is an architecture-oriented programming language based\nloosely on Smalltalk and Objective-C.\nzx, useful functions for scripting in Node.js.\nLearn shogi by …",
          "link": "https://leahneukirchen.org/trivium/2021-05-09",
          "publishedOn": "2021-05-09T18:51:36.000Z",
          "wordCount": 84,
          "title": "09may2021"
        },
        {
          "id": "https://leahneukirchen.org/trivium/2021-05-02",
          "author": null,
          "description": "OpenBSD 6.9 has been released, nice.\nExploiting Undocumented Hardware Blocks in the LPC55S69,\nby Laura Abbott from Oxide Computer.\nThese days even ROM chips get CVEs&#8230;\nHunting down the stuck BGP routes, by Ben Cox.\nWhat3Words &#8211; The Algorithm, explained by Cybergibbons.\nInheritance was invented as a performance hack, says Spencer Baugh.\nThe Hawaiian Earring Group (2013), by Jeremy Brazas.\ntmp.0ut Volume 1, a zine.\nEin Zeitstempel von ERFU, beschrieben von Andreas Kelz.\nBASIC 10-liners for Atari.",
          "link": "https://leahneukirchen.org/trivium/2021-05-02",
          "publishedOn": "2021-05-02T19:24:40.000Z",
          "wordCount": 93,
          "title": "02may2021"
        }
      ]
    },
    {
      "title": "Lambda the Ultimate - Programming Languages Weblog",
      "feedUrl": "http://lambda-the-ultimate.org/rss.xml",
      "siteUrl": "http://lambda-the-ultimate.org",
      "articles": [
        {
          "id": "http://lambda-the-ultimate.org/google-announces-logica",
          "author": null,
          "description": "You can read more about it at the Google Open Source blog post, Logica: organizing your data queries, making them universally reusable and fun.\nThey advocate for datalog-like language they developed internally at Google.\nThe reason?\nGood programming is about creating small, understandable, reusable pieces of logic that can be tested, given names, and organized into packages which can later be used to construct more useful pieces of logic. SQL resists this workflow. Although you can encapsulate certain repea…",
          "link": "http://lambda-the-ultimate.org/google-announces-logica",
          "publishedOn": "2021-04-29T14:50:27.000Z",
          "wordCount": 597,
          "title": "Google announces Logica: organizing your data queries, making them universally reusable and fun"
        }
      ]
    },
    {
      "title": "*incoherent yelling about worms*",
      "feedUrl": "http://gfzoda.tumblr.com/rss",
      "siteUrl": "https://gfzoda.tumblr.com/",
      "articles": [
        {
          "id": "https://gfzoda.tumblr.com/post/651632105876504576",
          "author": null,
          "description": "ace-pervert:\n\nnerdi-author-girl:\nessoreese:\n\ncwicseolfor:\nmaculategiraffe:\nme, reaching into my dresser drawer for black pants: I hope this isn’t the pair with big holes worn in the inner thighs\nMarie Kondo, gently over my shoulder: why is a pair of pants you find unwearable still in your dresser drawer\nme: oh shit that’s right!!  The dresser is for clothes that under some circumstance I might conceivably wear!!\nMarie Kondo, beaming proudly: Yes, that’s correct!!  These pants must have been your favorites. …",
          "link": "https://gfzoda.tumblr.com/post/651632105876504576",
          "publishedOn": "2021-05-19T17:20:03.000Z",
          "wordCount": 505,
          "title": "ace-pervert:nerdi-author-girl:\n\nessoreese:\ncwicseolfor:\n\nmaculategiraffe:\n\nme, reaching into my..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651622627892396032",
          "author": null,
          "description": "my-gender-is:\nmy gender is 37 axolotls in a top hat",
          "link": "https://gfzoda.tumblr.com/post/651622627892396032",
          "publishedOn": "2021-05-19T14:49:24.000Z",
          "wordCount": 245,
          "title": "my-gender-is:\n\nmy gender is 37 axolotls in a top hat"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651610411024760832",
          "author": null,
          "description": "42ds:\n\ndestroyingitself:\n\nqueeranarchism:\n\nrayvenreayes:\n\ngreat-tweets:\n\nBeware!\n\nAvoid sci-hub too👀\n\nFrom   Ask for PDFs from People with Institutional Access  \n\nIf you want to read an academic article that’s behind a paywall just email the author and ask politely if they will send you the article. Most academics will be thrilled that you want to read their work and will gladly send it to you. \n\nPSA",
          "link": "https://gfzoda.tumblr.com/post/651610411024760832",
          "publishedOn": "2021-05-19T11:35:13.000Z",
          "wordCount": 304,
          "title": "42ds:destroyingitself:queeranarchism:rayvenreayes:great-tweets:Beware!Avoid sci-hub too👀From   Ask..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651551744967442432",
          "author": null,
          "description": "muppethole:\n\nmuppethole:\n\nursula k le guin was right\n\nall of it, more or less",
          "link": "https://gfzoda.tumblr.com/post/651551744967442432",
          "publishedOn": "2021-05-18T20:02:44.000Z",
          "wordCount": 283,
          "title": "muppethole:muppethole:ursula k le guin was rightall of it, more or less"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651479006615584768",
          "author": null,
          "description": "guooey:\n\ni love them. they are referred to as godlike in many ancient cultures while at the same time existing as just some guy. the duality… it doesn’t get better than this",
          "link": "https://gfzoda.tumblr.com/post/651479006615584768",
          "publishedOn": "2021-05-18T00:46:36.000Z",
          "wordCount": 291,
          "title": "guooey:i love them. they are referred to as godlike in many..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651478425743343616",
          "author": null,
          "description": "maddiesharafian:\n\nA Blacksmith’s Dream",
          "link": "https://gfzoda.tumblr.com/post/651478425743343616",
          "publishedOn": "2021-05-18T00:37:22.000Z",
          "wordCount": 236,
          "title": "maddiesharafian:A Blacksmith’s Dream"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651254426098630656",
          "author": null,
          "description": "killapunk:\none thing ill never forgive fandom for is its constant sacrificing of found family in favor of shipping shipping shipping like just go rub one out and come back and reexamine the material",
          "link": "https://gfzoda.tumblr.com/post/651254426098630656",
          "publishedOn": "2021-05-15T13:16:59.000Z",
          "wordCount": 235,
          "title": "killapunk:\n\none thing ill never forgive fandom for is its constant sacrificing of found family in..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/651028914062458880",
          "author": null,
          "description": "airsignpariston:\n\nfunhaver:\n\nok but shonen rly did it with mob man. every protag is just some little boy but mob is the most boy ever and like it makes him so so incredible. like i have a soft spot for all of the sweet and pure protags like tanjiro and deku but like mob isn’t trying to be a superhero or save the world from evil he’s just trying to gain some muscle and talk to his crush and be a good big brother and yes i KNOW that’s the whole point of him and the show i just want to talk about him bc i love…",
          "link": "https://gfzoda.tumblr.com/post/651028914062458880",
          "publishedOn": "2021-05-13T01:32:34.000Z",
          "wordCount": 370,
          "title": "airsignpariston:funhaver:ok but shonen rly did it with mob man. every protag is just some little boy..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650987388688039936",
          "author": null,
          "description": "mysharona1987:",
          "link": "https://gfzoda.tumblr.com/post/650987388688039936",
          "publishedOn": "2021-05-12T14:32:32.000Z",
          "wordCount": 241,
          "title": "mysharona1987:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650852763362885632",
          "author": null,
          "description": "godsensei:\n\ni can’t see/hear the phrase, “you’re beautiful” without the primitive part of my brain producing a perfectly clear rendition of James Blunt going “YAH BYÜTEHFA'AL”",
          "link": "https://gfzoda.tumblr.com/post/650852763362885632",
          "publishedOn": "2021-05-11T02:52:44.000Z",
          "wordCount": 294,
          "title": "godsensei:i can’t see/hear the phrase, “you’re beautiful” without the primitive part of my brain..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650845696422035457",
          "author": null,
          "description": "thank you!!! and\nABBA IS FUCKING WHAT\nTHEY WHAT",
          "link": "https://gfzoda.tumblr.com/post/650845696422035457",
          "publishedOn": "2021-05-11T01:00:24.000Z",
          "wordCount": 326,
          "title": "<p>hello your hair looks really good and if nothing else is going well today i at least woke up to national news here in sweden that abba is recording new music again</p>"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650476941280952320",
          "author": null,
          "description": "kernalphage:\n\nintercal:\n\n&ldquo;I could look it up but it&rsquo;s more fun asking friends&rdquo; gang\n\n&ldquo;there&rsquo;s probably an objective answer for this but let&rsquo;s see if someone has a rant locked and loaded&rdquo; group chat",
          "link": "https://gfzoda.tumblr.com/post/650476941280952320",
          "publishedOn": "2021-05-06T23:19:12.000Z",
          "wordCount": 304,
          "title": "kernalphage:intercal:&ldquo;I could look it up but it&rsquo;s more fun asking friends&rdquo;..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650173038490435584",
          "author": null,
          "description": "mikkeneko:\n\nicannotreadcursive:\n\nicannotreadcursive:\n\nicannotreadcursive:\n\nicannotreadcursive:\n\nicannotreadcursive:\n\nicannotreadcursive:\n\nI feel like there’s needs to be, like, handbook for authors who post on Ao3 for effective metatext. \nBy metatext I mean like tagging, summary, and authors notes (especially initial authors notes at the beginning of a fic). The means by which we communicate to our readers what they’re getting into. \nBecause we kind of all have to learn it by osmosis and there are conventio…",
          "link": "https://gfzoda.tumblr.com/post/650173038490435584",
          "publishedOn": "2021-05-03T14:48:48.000Z",
          "wordCount": 512,
          "title": "mikkeneko:icannotreadcursive:icannotreadcursive:icannotreadcursive:icannotreadcursive:icannotreadcurs..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650166922538893312",
          "author": null,
          "description": "specialagentartemis:\n\nthesernotthedroidsurlooking4:\n\nspecialagentartemis:\n\n“whatever the fuck these two characters had going on” is a vastly underrated character dynamic\n\nyou guys are making it too shippy. no I need the ones in which you genuinely can’t tell what on God’s green earth is going on with these two people—like you can’t call it friendship, or rivalry, or attraction, or anything proper it’s just simply &lt;em&gt;weird&lt;/em&gt;\n\nsee. this person Gets It",
          "link": "https://gfzoda.tumblr.com/post/650166922538893312",
          "publishedOn": "2021-05-03T13:11:35.000Z",
          "wordCount": 323,
          "title": "specialagentartemis:thesernotthedroidsurlooking4:specialagentartemis:\n\n\n“whatever the fuck these two..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650166829517570048",
          "author": null,
          "description": "nudityandnerdery:\n\nvacuously-true:\n\nHey tumblr friends, in case I haven&rsquo;t told you lately, I have no idea what the FUCK half of you are on about and I WISH I didn&rsquo;t know what the rest of you are on about. Great work. Keep it up.",
          "link": "https://gfzoda.tumblr.com/post/650166829517570048",
          "publishedOn": "2021-05-03T13:10:06.000Z",
          "wordCount": 307,
          "title": "nudityandnerdery:vacuously-true:Hey tumblr friends, in case I haven&rsquo;t told you lately, I have..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/650162308961714176",
          "author": null,
          "description": "teathattast:",
          "link": "https://gfzoda.tumblr.com/post/650162308961714176",
          "publishedOn": "2021-05-03T11:58:15.000Z",
          "wordCount": 242,
          "title": "teathattast:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649988786385813504",
          "author": null,
          "description": "hitmewithcute:\n\nBaby bear catching snowflakes",
          "link": "https://gfzoda.tumblr.com/post/649988786385813504",
          "publishedOn": "2021-05-01T14:00:11.000Z",
          "wordCount": 249,
          "title": "hitmewithcute:Baby bear catching snowflakes"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649988699245903872",
          "author": null,
          "description": "acastersource:\n\nJames Acaster: Cold Lasagne Hate Myself 1999\n\nBonus:",
          "link": "https://gfzoda.tumblr.com/post/649988699245903872",
          "publishedOn": "2021-05-01T13:58:48.000Z",
          "wordCount": 298,
          "title": "acastersource:James Acaster: Cold Lasagne Hate Myself 1999Bonus:"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649589577570451456",
          "author": null,
          "description": "rusty-pulley-stars:\n\ni finally finished my quiz! how gullible are you?",
          "link": "https://gfzoda.tumblr.com/post/649589577570451456",
          "publishedOn": "2021-04-27T04:14:56.000Z",
          "wordCount": 297,
          "title": "rusty-pulley-stars:i finally finished my quiz! how gullible are you?"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649546754960801793",
          "author": null,
          "description": "jaubaius:\nAdorable round birds",
          "link": "https://gfzoda.tumblr.com/post/649546754960801793",
          "publishedOn": "2021-04-26T16:54:17.000Z",
          "wordCount": 261,
          "title": "jaubaius:\n\nAdorable round birds"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649543821387038720",
          "author": null,
          "description": "",
          "link": "https://gfzoda.tumblr.com/post/649543821387038720",
          "publishedOn": "2021-04-26T16:07:39.000Z",
          "wordCount": 252,
          "title": "Photo"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649273715109036032",
          "author": null,
          "description": "princessithaca:\nazbukivedii:\n\nstevhoa:\nirtenyev:\n\nwhen w. h. auden said “evil is unspectacular and always human” and ursula k. leguin said “this is the great treason of the artist: a refusal to admit the banality of evil and the terrible boredom of pain”\n\nwhen toni morrison said “i just think goodness is more interesting. evil is constant. you can think of different ways to murder people, but you can do that at age five. but you have to be an adult to consciously, deliberately be good – and that’s complicat…",
          "link": "https://gfzoda.tumblr.com/post/649273715109036032",
          "publishedOn": "2021-04-23T16:34:26.000Z",
          "wordCount": 512,
          "title": "princessithaca:\n\nazbukivedii:stevhoa:\n\nirtenyev:when w. h. auden said “evil is unspectacular and..."
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649030707651411968",
          "author": null,
          "description": "doggosource:\nstrech",
          "link": "https://gfzoda.tumblr.com/post/649030707651411968",
          "publishedOn": "2021-04-21T00:11:56.000Z",
          "wordCount": 254,
          "title": "doggosource:\n\nstrech"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649030701428228096",
          "author": null,
          "description": "multi-couleur:\n\nMOB PSYCHO 100\nGIF ANIMATION COLLECTION",
          "link": "https://gfzoda.tumblr.com/post/649030701428228096",
          "publishedOn": "2021-04-21T00:11:50.000Z",
          "wordCount": 260,
          "title": "multi-couleur:MOB PSYCHO 100GIF ANIMATION COLLECTION"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649030686988173313",
          "author": null,
          "description": "dragonknightcamilla:\n\nhappy 4/20",
          "link": "https://gfzoda.tumblr.com/post/649030686988173313",
          "publishedOn": "2021-04-21T00:11:36.000Z",
          "wordCount": 256,
          "title": "dragonknightcamilla:\nhappy 4/20"
        },
        {
          "id": "https://gfzoda.tumblr.com/post/649030525199220736",
          "author": null,
          "description": "oct2pus:\n\nshubbabang:\nshubbabang:\nhappy 420 and day i reserve a spot in hell\nits that time again folks\n@shubbabang \n\n\n(Source)",
          "link": "https://gfzoda.tumblr.com/post/649030525199220736",
          "publishedOn": "2021-04-21T00:09:02.000Z",
          "wordCount": 236,
          "title": "oct2pus:\nshubbabang:\n\nshubbabang:\n\nhappy 420 and day i reserve a..."
        }
      ]
    },
    {
      "title": "CuriosityConfusion",
      "feedUrl": "http://curiosityconfusion.tumblr.com/rss",
      "siteUrl": "https://curiosityconfusion.tumblr.com/",
      "articles": [
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651378726843695104",
          "author": null,
          "description": "batmanisagatewaydrug:\n\nah-beans-im-a-transmed:\n\nbatmanisagatewaydrug:\n\nqueer is a gender, sexuality, romantic orientation, political alignment, and mission statement, babey\n\nqueer is literally a slur that means weird and strange \n\nand I most certainly am weird and strange, what else you got?",
          "link": "https://curiosityconfusion.tumblr.com/post/651378726843695104",
          "publishedOn": "2021-05-16T22:12:42.000Z",
          "wordCount": 314,
          "title": "batmanisagatewaydrug:ah-beans-im-a-transmed:batmanisagatewaydrug:queer is a gender, sexuality,..."
        },
        {
          "id": "https://curiosityconfusion.tumblr.com/post/651301886100684800",
          "author": null,
          "description": "smokethereisfire:\n\nRichard Calver (1946-) - Dandelions Rejoicing",
          "link": "https://curiosityconfusion.tumblr.com/post/651301886100684800",
          "publishedOn": "2021-05-16T01:51:20.000Z",
          "wordCount": 265,
          "title": "smokethereisfire:Richard Calver (1946-) - Dandelions Rejoicing"
        }
      ]
    }
  ],
  "cliVersion": "1.7.2"
}